{
    "en": {
        "languages":["english", "spanish", "french"],
        "personal": {
            "journey": {
                "title": "Welcome! 👋",
                "description": [
                    "I'm /h Santiago, unequivocally Mexican, and I work as a /h Software /h Engineer.",
                    "I like reading, music, coding, making, teaching, learning, writing and biking. And parks. And museums. I've acquired quite the appetite for life.",
                    "I think actions speak the loudest, so feel free to peruse (ah I love contronyms) this site and see what I do, and what I write.",
                    "If that's too much time: if my friends had to describe me with 1 word they'd probably say  unconventional. With 2 words? They might add contradictory. And with 3 I'm hopeful they'd admit I'm funny.",
                    "They say you are what you eat, so here's a bit of my diet:",
                    "(or should I say... a bite of my diet? Ha.ha.)"
                ]
            },
            "books": [
                "images/books/anElegantDefense.jpg",
                "images/books/immune.jpeg",
                "images/books/whenTheBodySaysNo.jpeg",
                "images/books/gunsGermsAndSteel.jpg",
                "images/books/theJakartaMethod.jpg",
                "images/books/crimeAndPunishment.jpg",
                "images/books/manSearchForMeaning.jpg",
                "images/books/madameBovary.jpg",
                "images/books/aHundreadYearsOfSolitude.jpg",
                "images/books/theFeastOfTheGoat.jpg",
                "images/books/capital.jpeg",
                "images/books/theTyrannyOfMerit.jpg",
                "images/books/braidingSweetgrass.jpeg",
                "images/books/thinkingFastAndSlow.jpg",
                "images/books/1984.jpg",
                "images/books/braveNewWorld.jpg",
                "images/books/fahrenheit451.jpg",
                "images/books/hitchikersGuide.jpeg",
                "images/books/understandingPower.jpeg",
                "images/books/anna_karenina.jpeg",
                "images/books/brothers_karamazov.jpeg",
                "images/books/how_to_solve_it.jpg",
                "images/books/lotr.jpeg",
                "images/books/metamorphosis.jpeg"
            ],
            "movies": {
                "posters": [
                    "images/movies/wall-e.png",
                    "images/movies/theIronGiant.png",
                    "images/movies/spiderverse.png",
                    "images/movies/pussInBoots.png",
                    "images/movies/coco.png",
                    "images/movies/howlsMovingCastle.png",
                    "images/movies/laVieEstBelle.png",
                    "images/movies/ladyBird.png",
                    "images/movies/moonlight.png",
                    "images/movies/roma.png",
                    "images/movies/pansLabyrinth.png",
                    "images/movies/whiplash.jpeg",
                    "images/movies/blackSwan.png",
                    "images/movies/1917.png",
                    "images/movies/joker.png",
                    "images/movies/parasite.png",
                    "images/movies/requiem.png",
                    "images/movies/theShining.png",
                    "images/movies/trainspotting.png"
                ]
            },
            "albums": {
                "covers": [
                    "images/albums/21-savage_i-am-i-was.png",
                    "images/albums/black-keys_el-camino.jpeg",
                    "images/albums/brockhampton_saturation.png",
                    "images/albums/gorillaz_2001.png",
                    "images/albums/kenny-beats_louie.jpeg",
                    "images/albums/little-simz_no-thank-you.jpeg",
                    "images/albums/mac-miller_faces.jpeg",
                    "images/albums/the-strokes_the-new-abnormal.png"
                ]
            }
        },
        "professional": {
            "work": {
                "title": "Jobs I've done.",
                "positions" : [
                    {
                        "place": "Figma, 2023 - Present",
                        "title": "Software Engineer: Infrastructure",
                        "description" : [
                            {"paragraph": "I've been notorious for learning fast and getting things done. My work includes:"},
                            {
                                "list": [
                                    "Migrating our REST API's backend; this was one half of a service deprecation project that saved $18M a year.",
                                    "Building essential infrastructure for AI Search features.", 
                                    "Currently working on our Rust/Typescript multiplayer technology for working collaboratively"
                                ]
                            },
                            {"paragraph": "I'm result oriented, my tools vary, but I've mostly used: Ruby, Rust, TypeScript, React, Terraform and AWS, as well as some Kubernetes"}
                        ],
                        "image": "images/experience/figma.png"
                    },
                    {
                        "place": "University of Montreal, 2021 - 2023",
                        "title": "Teaching and Research Assistant.",
                        "description" : [
                            {"paragraph": "From the moment I landed in Montreal to the moment I left for NYC I worked as a Teacher Assistant for 2 years with around 1650 students (not accounting for overlap):"},
                            {
                                "list": [
                                    "Programming 101 with Python (for 3 terms)",
                                    "Programming Language Concepts and Paradigms (for 2 terms)", 
                                    "Discrete Structures in Computer Science (2 terms)",
                                    "Web development and design (2 terms)", 
                                    "Software Engineering", 
                                    "Advanced Java Concepts"
                                ]
                            },
                            {"paragraph": "A BIG thank you -both for bearing with me through that experience, and for mentoring me through it- to: Marc Feeley, Olivier Melançon, Stefan Monnier, Miklós Csűrös, Sébastien Roy, Amal Ben Abdellah and Michel Reid"},
                            {"paragraph": "Additionally, I worked as a Research Assistant in collaboration with the department of Psicology, Computer Science and the Digital Education team to build a mental health app for students."}

                        ],
                        "image": "images/experience/Paradigms.png"
                    },
                    {
                        "place": "Ixiasoft",
                        "title": "Full Stack Developer - intern, 2022",
                        "description" : [
                            {"paragraph": "During the summer of 2022: I Implemented experimental features, documented and debugged on Ixiasoft's DITA CCMS web application for technical documentation. Mainly worked with:"},
                            {
                                "list": [
                                    "Java",
                                    "TypeScript", 
                                    "React and Redux", 
                                    "Apache", 
                                    "Maven", 
                                    "CSS"
                                ]
                            }
                        ],
                        "image": "images/experience/fullstack.png"
                    }
                ]
            },
            "education": {
                "title":"Places where I've studied.",
                "classHeader":"Some of my favorite classes:",
                "schools" : [
                    {
                        "name": "Université de Montréal",
                        "image": "images/institutions/UdeM.jpeg",
                        "degree": "Bachelors of Science, Computer Science",
                        "details": "Montreal | 2020-2023",
                        "abreviation": "UdeM",
                        "description": 
                        [
                            "I did my honors project on genome assembly scaffolding with paired sequencing reads -which is a fancy way of saying: I arranged DNA snippets to build a genome, its hard because the snippets are messy, faulty, and could go anywhere... so how do you know where to put them? The snippets I studied were from an Agrobacterium, which is a bacteria that makes plants sick =(. I was also a consulting director at 180DC UdeM."
                        ],
                        "classes": [
                            "Data Science",
                            "Operating Systems",
                            "UI/UX",
                            "Data Structures",
                            "Algorithms",
                            "Data Science",
                            "Quantum Informatics",
                            "Databases",
                            "Machine Learning",
                            "3D Computer vision",
                            "Linear Algebra",
                            "Genetics"
                        ]
                    },
                    {
                        "name": "Lycée franco-mexicain",
                        "image": "images/institutions/LFM.jpeg",
                        "degree": "French Baccalaureat, Engineering Science",
                        "details": "Mexico | 2017-2020",
                        "abreviation": "LFM",
                        "description": [
                            "I went on the Science track, specialized in maths and engineering, and finished with a mention très bien: TB -which was the highest honors available at the school-, I was a candidate to the concours general in mathematics, physics and engineering (only the best of each school are allowed to participate). I founded and  led the Machine Learning club, and I was in the Programming Club"
                        ],  
                        "classes": [
                            "Advanced Maths",
                            "Engineering Sciences",
                            "French",
                            "English",
                            "Spanish",
                            "German"
                        ]
                    }
                ]
            },
            "projects": 
            {
                "title":"Academic and Personal Projects",
                "projects": [
                    {
                        "title": "Multithreaded web server",
                        "description": [
                            "Built a Multithreaded web server using Rust! It's the final project in the Rust book, and I figured it'd be the best way to get acquainted with the language."
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/rust.jpg"
                    },
                    {
                        "title": "Orball",
                        "description": [
                            "Learned to make 2D games using Godot and gdscript. Didn't bother to finish it, but I did implement some procedural generation and per-chunk incremental loading (this prevents the typical case where you open a game and its very slow to boot up) that I'm happy with. You can play it, but honestly it aint a fun game!",
                            ""
                        ],
                        "link": "https://gfecito.itch.io/orball?secret=GNoDj8sJ0n9m71KTTVJOJrjcjD8",
                        "websiteLabel":"Play it now (move with WASD; eat by holding down E)",
                        "image": "images/projects/Orball.jpg"
                    },
                    {
                        "title": "Looks",
                        "description": [
                            "Built the prototype for a clothing-oriented social media platform and app using Swift (with SwiftUI and UIKit), Typescript, Firebase. I built the iOS prototype, an admin page, a waitlist/promo site, as well as setting up our DB, compute, permissions and a connection to Amazon via API.",
                            ""
                        ],
                        "link": "https://looks-waitlist.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/looks.png"
                    },
                    {
                        "title": "AI for Climate",
                        "description": [
                            "This project, under Mila - Quebec AI Institute, aims to improve climate modeling for weather forecasting, agriculture, and more. Current models struggle with unreliable small-scale data. As project manager and core contributor, I organized our team to enhance these models with state-of-the-art solutions, made a dedicated website and worked on our data pre-processing for the models.",
                            ""
                        ],
                        "link": "https://climate-model-downscaling.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/MLClimate.png"
                    },
                    {
                        "title": "Genomics",
                        "description": [
                            "This is a research and development project for UdeM's Laboratory of Computational and Theoretical Biology. Researched and implemented an API for genome assembly refinement, as well as a binning scheme data structure, using JAVA and the htsjdk library. The work is thoroughly documented and explained here:",
                            ""
                        ],
                        "link": "https://genome-assembly-scaffolding.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Genomics.jpeg"
                    },
                    {
                        "title": "AI 3D Computer-Vision",
                        "description": [
                            "This project for UdeM's Laboratory of 3D Computer Vision involved implementing CNN architectures based on GC-Net for binocular stereoscopy using Mathematica. I focused on depth variations, residual nets, estimation quality, and computational expense. Code and models are available online.",
                            ""
                        ],
                        "link": "https://github.com/Gfecito/GC-Neat",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Disparity.png"
                    },
                    {
                        "title": "ML Models",
                        "description": [
                            "I developed machine learning models for supervised tasks using Python, implementing KNN, Parzen Windows, perceptrons, and SVMs from scratch, and using libraries for neural networks and CNNs. I tested these models on regression and classification problems with datasets including bank records, phone records, and MNIST.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/ML.png"
                    },
                    {
                        "title": "File Management System",
                        "description": [
                            "We implemented a 'File Allocation Table'-based storage management system using C for a 32-bit Linux system. In human talk: we built the file -and memory- management section of an operating system.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/FAT32.jpeg"
                    },
                    {
                        "title": "Database",
                        "description": [
                            "Planned then built a small database for a library. In the planning, we used formal methods for entity-relationship modelling, then relational modelling, relational algebra, request optimization and database normalization. For the implementation, we used SQL, Hibernate (Java) and Maven for compilation and delivery of the executable.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Database.jpeg"
                    },
                    {
                        "title": "Gesture Recognition Web-App",
                        "description": [
                            "Partitioned and preprocessed a database, built and trained a convolutional neural network model, exported and then implemented it into a dynamic web platform. I built the latter using Flask (Python) and Jinja.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/GestureRecognition.gif"
                    },
                    {
                        "title": "Vaccination Management",
                        "description": [
                            "I developed a Java app with an interactive graphical interface and a data management system. The process included engineering planning, interviews, prioritization, use case definitions, risk analysis, non-functional requirements, constraints, VPP modeling, design, prototyping, automatic testing with JUnit, team management, scheduling, and documentation with Javadoc.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Vaccination.png"
                    },
                    {
                        "title": "21st Century Abacus",
                        "description": [
                            "School project for object-oriented programming with Java; it's a small window. Using JavaFX, we (2 people) made a fancy window with 2 counters: you can add and subtract, divide and multiply, undo and redo. Every action performed in the app was temporarily saved, and as such the actions log was always available for exporting as a .txt file.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/CounterThumbnail.png"
                    },
                    {
                        "title": "Interpreters",
                        "description": [
                            "A Pseudo-Lisp interpreter made with Haskell: Built the interpretation and evaluation section of a Haskell program that could read and execute files from a Lisp-inspired language. Dealt with functions, closure, environments, variables, recursion and recursive definitions, etc... the whole enchilada. Then built a Pseudo-Haskell interpreter, where I used Prolog for interpreting and executing, same features as before, but with added type inference.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Interpreter.png"
                    },
                    {
                        "title": "Environnemental Simulation",
                        "description": [
                            "Using object-oriented programming we made an environmental simulation program. It read XML files describing animals or plants and simulated them for a certain amount of epochs: the way they interacted, what they ate, their energy consumption, whether they died or reproduced, and so on.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/WildLionSimulator3D.jpeg"
                    },
                    {
                        "title": "This site!",
                        "description": [
                            "Originally made from scratch with HTML, CSS, JavaScript, jQuery as well as the Animate on Scroll library. Currently built with React, TypeScript, JSON, CSS... and a sprinkle of love!"
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/ThisSite.jpeg"
                    }
                ]
            },
            "awards": {
                "title":"Awards",
                "dateLabel":"Date: ",
                "awards": [
                    {
                        "title":"ICPC NE-NA",
                        "date":"February 2023",
                        "description":[
                            "The 2nd best team in DIRO's history in this prestigious programming competition",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"DIRO's excellence scholarship",
                        "date":"December 2021",
                        "description":[
                            "Excellence scholarship awarded to the top bachelor students in the DIRO (Department of Computer Science and Operations Research)",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"Exemption Scholarship for international students",
                        "date":"August 2020",
                        "description":[
                            "Biggest merit-based scholarship for international students at the Université de Montréal",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"French regional math olympiads | Best team, Top 3 individual",
                        "date":"2019",
                        "description":[
                            "My region spanned from Mexico to Panama, and included all french teaching institutions there."
                        ],
                        "image":"images/trophy.png"
                    }
                ]
            }
        },
        "articles": {
            "title":"Things I think. Things I write.",
            "closeArticleLabel":"Close article",
            "scrollLabel":"Scroll to Bottom",
            "articles":
                [
                    {
                        "title": "On Learning and Teaching",
                        "description": "Reflections on how to study, learn and teach effectively.",
                        "image": "images/vlog_thumbnails/teacher_in_class.jpeg",
                        "contents": [
                            {"title": "On learning and teaching."},
                            {
                                "image": "images/vlog_images/dead_poets_society.jpg",
                                "caption": "Robin Williams as John Keating in Dead Poets Society",
                                "link":"https://www.huffpost.com/entry/the-dead-poets-society-gu_b_749665"
                            },
                            {"paragraph":[
                                "In this article I’ll be sharing what I’ve learned, both as a student and as a teacher over the years. The main focus will be finding effective approaches to learning as well as effective approaches to teaching.",
                                "For an objectively more thorough perspective I’d strongly recommend G. Polya’s “How to Solve It”, which is a fantastic book on both teaching and learning the art of problem solving."
                            ]},
                            {"paragraph":["When I mention good teachers throughout the article, there’s an implicit recognition that bad teachers exist. Bad teachers -I believe- are good teachers to be; because teaching is in itself learnt."]},
                            {"title": "Effective practice:"},
                            {"paragraph":["Practice makes perfect. Well not quite, but practice does make better. I feel like the The Parable of the Pottery Class illustrates this in the most succinct form:"]},
                            {"quote":
                                "There was once a pottery teacher called Brian. One month, he decided to split his class into two groups. Group A had to make a pot every day for 30 days (so 30 pots in total). Group B had to work on a single pot for the whole 30 days. At the end of the month, Brian judged the quality of the pots. Without exception, every one of the top 10 pots came from Group A, the guys that made one pot per day. None came from the group that focused on perfecting their single pot."
                            },
                            {"paragraph":[
                                "Learners looking to perform better need to practice thoroughly. Deliberate Practice is usually the best approach, and is already well documented: practice, but do so with a plan. "
                            ]},
                            {"paragraph":[
                                "In particular, to borrow from Polya, a good approach to Deliberate Practice is to do multiple attempts, iteratively, based on his 4 principles: understand the problem, make a plan, carry out the plan, look back on your work."
                            ]},
                            {"paragraph":[
                                "In my experience, most students fail to do at least 1 of these. I believe this to be a failure of teachers not communicating (or perhaps not even understanding) that these very principles are the reasons why we educate in the structure we do:"]
                            },
                            {"list":[
                                "Lecture/Demo: understand the problem.",
                                "Instructions: make a plan (the more vague the instructions, the more of this is handed off to the student).",
                                "Assignments: carry out the plan.",
                                "Grades, tests, feedback: look back on your work."
                            ]},
                            {"paragraph":[
                                "Being a student unfamiliar with these principles, school feels silly and often arbitrary in its ways.",
                                "As a teacher, not knowing these principles one might be misguided into a dynamic which quite often can be quite fruitless for both students and teacher.",
                                "Think of the classic movies during middle school, or long tangents during lectures: entertaining, but time would be better spent doing that with friends than an old stranger.",
                                "We seek a teacher to teach: you wouldn’t want your doctor delaying surgery to talk about his divorce."
                            ]},
                            {"paragraph":[
                                "Naturally, you might’ve remarked that not everything is equally easy to practice!",
                                "You might think of learning English, where you're severely disadvantaged: your classmates’ parents speak it, and they can practice easily at home, but you can't! ",
                                "Or math, when their sibling is an accountant who can guide them through the 4 principles.",
                                "There are even some things that might seem impractice-able: like how to take a test or doing a backflip."
                            ]},
                            {"paragraph":[
                                "Now here’s where we must be creative. If to learn effectively we must practice time and time again, then we must find a way to turn any learnable topic into a practice-able topic. I’ve observed that to make Deliberate Practice possible, we need two ingredients:"
                            ]},
                            {"list":[
                                "A safe space to fail.",
                                "Strong Feedback: strong feedback is fast, frequent and actionable."
                            ]},
                            {"paragraph":[
                                "Games do this excellently, and you’ll find that players who play more typically are significantly better than those who play less. This is because games are made in a way that optimizes for effective practice: "
                            ]},
                            {"list":[
                                "If you fail, you can play again and you’re fine (it is safe).",
                                "When you fail you immediately know, and you can try again (Strong Feedback)"
                            ]},
                            {"paragraph":[
                                "Building a safe space for practice and creating a strong feedback pipeline are historically quite challenging (hence why excellent schools are seldom). I don’t know of any generalizable recipe, but here are some examples:"
                            ]},
                            {"list":[
                                "Building a safe space: for learning to take tests, one might take a sample of many many exams from the library or the internet and practice at home, replicating exam conditions (silence, time constraints, documentation constraints) and evaluating themselves (or doing so with a friend, usually to better results).",
                                "Building a safe space: to learn to do backflips one might set up cushioning and a physical environment where getting hurt is less likely. It’d be preferable to make serious injury near impossible by having an expert guide and look after you.",
                                "Strong feedback: a student might take practice tests they tried themselves, and already graded their teacher, asking for advice.",
                                "Strong feedback: nowadays, although one must be very skeptical and careful with this tool, a student may iterate with a GPT language model to get feedback on their work/ideas. This works surprisingly well, which I’d attribute to the internet being full of forums with likely similar questions, and weighted answers that work as feedback."
                            ]},
                            {"paragraph":[
                                "Good teachers will create a safe space to fail in their classes, and consistently provide strong feedback.",
                                "Good teachers will also fail students who failed to assimilate the material, with the intent of giving them more time to do so. A safe space is not an easy space, but it is safe: if a student is let go without proper preparation, they will eventually fail in a space where it isn't safe to do so."
                            ]},
                            {"title": "The abstract and the concrete."},
                            {
                                "image": "images/vlog_images/abstract_vs_concrete.png",
                                "caption": "The Development of Concrete and Abstract Thinking Patterns by Iryna Horkovska",
                                "link":"https://calmerry.com/blog/psychology/the-development-of-concrete-and-abstract-thinking-patterns/"
                            },
                            {"paragraph":[
                                "Nice! Now we can learn new things. But how do we remember them?"
                            ]},
                            {"paragraph":[
                                "The following is quite a simplification of the workings of the brain, yet sufficient for our intent of learning better:",
                                "The brain works through associations: the stronger the association, the more powerful the connection. In learning, the strength of these connections seems proportional to the number of times the association is made and how interesting we find it.",
                                "A memory which is strongly bound to an event will be recalled when the event takes place!",
                                "(Think of the breeze caressing the grass coming to mind with the sound of the wind, or pure -distilled- ire upon seeing a League of Legends lobby with that one guy you played with a year ago)."
                            ]},
                            {"paragraph":[
                                "Cool. Let 's exploit that."
                            ]},
                            {"paragraph":[
                                "Make it interesting: Injecting elements of interest ensures that the information stands out in your mind. This could involve using vivid imagery, storytelling, or real-world analogies that capture your attention."
                            ]},
                            {"paragraph":[
                                "Make it related/coherent: The association should make sense and be easy to recall. It's like creating a mental roadmap—each step logically leads to the next, aiding in retrieval if you forget initially."
                            ]},
                            {"paragraph":[
                                "Good teachers leverage these principles by incorporating props and real-life examples into their lessons. "
                            ]},
                            {"paragraph":[
                                "By linking abstract concepts to tangible objects or familiar scenarios, they help students forge meaningful connections that enhance learning and retention.",
                                "For instance, they might use props like colorful diagrams or memorable anecdotes to make complex ideas more accessible and memorable.",
                                "Like Michael buying 100 pineapples or Antonia needing to cut the cable that is in an odd numbered position, in between two red cables, disarming a bomb!"
                            ]},
                            {"paragraph":[
                                "Making it interesting also has the beautiful benefit of giving place to a potentially more lively classroom: students are more fun to be around… when they’re engaged!"
                            ]},
                            {"paragraph":[
                                "A common trap is to over-index on making it interesting, and forgetting to make it related: this is easy to fall into because teachers already have the associations in their minds, but its essential for a teacher to remember that these associations don’t yet exist in the minds of their students: which is precisely why we’re teaching them!"
                            ]},
                            {"paragraph":[
                                "Make it interesting, but make sure to connect it coherently!!! Let’s avoid any further “what does this have to do with anything?” puzzled looks, and connect the shiny dots we illustrate."
                            ]},
                            {"title": "Pay. Attention."},
                            {
                                "image": "images/vlog_images/paying_attention.jpg",
                                "caption": "Students paying attention in class",
                                "link":"https://img.freepik.com/free-photo/students-paying-attention-class_23-2148844732.jpg?t=st=1723640378~exp=1723643978~hmac=a62cf2da6a222aab3bf4219ce1587923447f1278dd28d9aace30c31b00314cad&w=1480"
                            },
                            {"paragraph":[
                                "Humans are amazing at multitasking, but we’re terrible at multi-thinking. My idea of why this happens is based on Daniel Kahneman’s work, and I’d explain my reasoning as follows:"
                            ]},
                            {"list":[
                                "System 2 thinking is brilliant in parallelizing, because there are no profound considerations to be made, your intuition can make easy decisions quickly and in parallel.",
                                "System 1 thinking is expensive and deliberate. If you get distracted, you’re effectively disconnecting parts of your System 1 computer, and handicapping any chance you have of thinking, learning and remembering effectively."
                            ]},
                            {"paragraph":[
                                "If you’re doing something hard, nuanced, sensitive, or novel: please focus.",
                                "As a teacher: it’s easier for students to focus when the material is interesting and you make its usefulness obvious."
                            ]},
                            {"title": "Things making sense."},
                            {
                                "image": "images/vlog_images/eureka.jpg",
                                "caption": "Archimedes exclaiming Eureka, by Pietro Scalvini and Carlo Orsolini",
                                "link":"https://en.wikipedia.org/wiki/Eureka_%28word%29"
                            },
                            {"paragraph":[
                                "It’s fundamental that the material being learned is coherent end to end. The material should be self contained, or at least enlist all its dependencies so students can quickly identify and fill in the gaps. Kind of like good software!"
                            ]},
                            {"paragraph":[
                                "The student learning something full of gaps will need to fill them in themselves. If there are incoherences they must also resolve them. Failing to do this will lead a student to fail to understand the problem, which is the first principle in getting anything done.",
                                "A teacher should always aim to have complete, sensible material and ideally their students would have no need to intervene."
                            ]},
                            {"paragraph":[
                                "Incoherent material won’t be trusted, and will be forgotten with a lot more ease.",
                                "Incoherent material, even if useful, won't be used as often, because the students won’t know how to explain it."
                            ]},
                            {"title": "The Importance of Peers and discussions."},
                            {
                                "image": "images/vlog_images/peers.png",
                                "caption": "4 Tips to Design an Engaging Discussion in Canvas, by Jillian Rubman - MIT",
                                "link":"https://mitsloanedtech.mit.edu/2022/01/07/4-tips-to-design-an-engaging-discussion-in-canvas/"
                            },
                            {"paragraph":[
                                "Finally, nothing great is learned alone. Many replace live discussions by the reading and writing of papers, books, letters, or forum discussions, but every significant step towards learning (and symmetrically, towards teaching) is given through communicating with others."
                            ]},
                            {"paragraph":[
                                "Talking with a mentor or a peer about a problem, or a topic, or indeed anything where insight is to be made, is one of the most effective and productive ways to learn. A healthy conversation forces us to employ all the mechanisms discussed in this article:"
                            ]},
                            {"list":[
                                "Effective practice: a healthy discussion has a back and forward, where one can be wrong many times, corrected, and quickly re-engage in conversation.",
                                "The abstract and the concrete: your peers will stop listening to you if you’re too abstract.",
                                "Pay. Attention: on the flipside people will be disgruntled (scary!) if you don’t pay attention to them when they’re directly talking with you (I would know, I space out all the time, sorry).",
                                "Things making sense: incoherence will be interrupted, or even playfully ridiculed, giving a mentor the chance to do better. Taking offense (or meaning to offend) would be a terrible waste of feedback."
                            ]},
                            {"title": "In conclusion."},
                            {
                                "image": "images/vlog_images/classroom_sunset.jpg",
                                "caption": "Classroom Sunset | Lofi HipHop Mix |, by Yūgen",
                                "link":"https://www.youtube.com/watch?v=-nHf84N0Iu4"
                            },
                            {"paragraph":[
                                "To wrap up, our exploration into learning and teaching has uncovered some key strategies. We must practice with purpose and get feedback to improve. We need a safe space for mistakes. Interesting and relatable lessons are easy to understand and remember. Collaborating with peers and mentors is a learning-superpower."
                            ]},
                            {"paragraph":[
                                "And remember: there are many things you still can’t teach, but there’s nothing out there you can’t learn! =)"
                            ]}
                        ]
                    },
                    {
                        "title": "You Don’t Really Exist",
                        "description": "Identity is but a useful abstraction; not reality.",
                        "image": "images/vlog_thumbnails/sisyphus.jpeg",
                        "contents": [
                            {"title": "Who are you?"},
                            {"paragraph": [
                                "No, I asked not your name, not your occupation nor sunday afternoon pastimes. Who are you?", 
                                "When I was a kid, I remember a moment where my mother asked me that question. It eventually led me to panic; for every answer I gave, there was a “but is that who you are?”. Who am I?",
                                "And yet when you ask me who someone else is, that is a most natural question, with quite simple answers."
                            ]},
                            {"title":"Perception and Abstractions."},
                            {"paragraph": [
                                "The world is mighty complex. There is too much information for our brain to process entirely, so we must pick and choose. Our perception is directly tied to our cognition in such tangled ways that you’ll see mostly what you already expect (see the 'Invisible Gorilla' experiment).",
                                "How do we make sense of such chaos?"
                            ]},
                            {"paragraph": [
                                "Abstractions. Patterns and abstractions."
                            ]},
                            {"paragraph": [
                                "When we observe the world, different people see different things. If there is such a thing as a unique noumenal world, there is a phenomenal world unique to each of us (the optimist would say that the world is yours… hehe).",
                                "These different perceived (phenomenal) worlds come from the different ways we think, and at times differences in our senses (your eyes are not necessarily identical from mine!).",
                                "The perception we have is unique to us. And so are our interpretations of what we see.",
                                "Our understanding of the world is a mixture: knowledge and stimuli. You perceive, you sense, and you make sense of the information with what you “know” of the world.                    Your reasoning is framed within the constraints of all your previous reasonings, of all that you’ve seen. Every tune, every painting, every smile and every mistake; they all change the way you think.",
                                "However your knowledge is finite: we know nothing to an infinite granularity, but only down to a certain level of detail. Rare is the person both aware of the tiniest physics going on inside their nails, and the mind games that rule diplomacy.",
                                "In understanding, we must limit detail. We must abstract."
                            ]},
                            {"paragraph": [
                                "Abstractions. Patterns and abstractions.",
                                "The realm of abstractions is too vast, and need not all be explored to show that you don’t exist.",
                                "While we abstract in many ways (and quite fascinatingly), let us focus on the abstractions you do every day during your commute: People.",
                                "When we perceive Someone Else, we must make sense of the things we sense: the look of their face, their eyes, the sound of their voice or the warmth of their hands. We wrap all of this information into a single agglomeration: a person.",
                                "We may accumulate details that we associate with that person: what makes them laugh, their gait, the way they look at the starry sky or yell in traffic. Whether they feel to you as friend or as foe (which, in themselves, are abstractions)                    As we increase detail, we feel we know them more.",
                                "When asked who they are, you’ll reply with some subset of these details.                    This is useful. If you had to absorb every bit (pun intended) of information from someone before being able to speak about them, social interactions would be impossibly expensive in time, memory and usage of your brain.",
                                "Yet abstractions are useful precisely for the same reason they’re dangerous. They lack detail. They lack nuance.",
                                "Abstractions are dangerous when speaking about conflict (think of the idea of the enemy), they’re dangerous when speaking of love, they’re dangerous when listening: if we listen for truth, rather than for abstraction, we’d be misled into an unfounded -yet very strong- sense of confidence.",
                                "This lack of granularity means that you’ll never really know who anyone else is. Not entirely. You at most can know them better than anyone else, but if we’re sincere we must recognize that we’ll never know who someone really is."
                            ]},
                            {"title": "The mirror, and why you can’t know yourself."},
                            {
                                "image": "images/vlog_images/mirror.png",
                                "caption": "Man looking at mirror",
                                "link":"https://www.mutualart.com/Artwork/Man-With-a-Mirror/0833A9BCDCD04E35"
                            },
                            {"paragraph":[
                                "When you look in the mirror, what do you see? It is in answering “Myself” that we immediately, inadvertently condemn ourselves to abstraction. The image reflected back at us is merely a surface-level representation, a snapshot of physical appearance that barely scratches the surface of our true essence.",
                                "But beyond the physical reflection lies a labyrinth of complexities, contradictions, and ever-changing thoughts and emotions. Attempting to define oneself is akin to grasping at shadows; the more we seek to capture our identity, the more it seems to slip through our fingers.",
                                "One might argue that introspection offers a path to self-discovery, a journey inward to uncover the truths that lie buried within our psyche. But even introspection has its limitations, for our perceptions of ourselves are colored by biases, insecurities, and external influences.",
                                "And what of the role of memory in shaping our sense of self? Memories are not immutable records of the past but malleable narratives that evolve over time, shaped by selective recall and reinterpretation. Our recollections of past events are filtered through the lens of present consciousness, colored by emotions and perceptions that may distort or embellish the truth.",
                                "In the end, the quest to know oneself may be an exercise in futility, a Sisyphean struggle against the tide of impermanence and uncertainty. Perhaps, instead of seeking to define ourselves, we should embrace the enigma of our existence, embracing the fluidity and ambiguity of identity.",
                                "For in the absence of a fixed self, there lies the potential for boundless exploration and discovery, a journey of self-discovery that transcends the constraints of definition and limitation."
                            ]},
                            {"title":"Physicality, unity: you melt into the universe."},
                            {
                                "image": "images/vlog_images/cosmos.png",
                                "caption": "Man looking at mirror",
                                "link":"https://www.ashvinharrison.com/product/abstract-universe-moon-illusion/"
                            },
                            {"paragraph":[
                                "We’ve shown that the thought of the self (phenomenal) is water, river, flow. A current that can’t be encapsulated by identity, but that rather flows and bends and chemically mutates through life.",
                                "However, the foregoing of the self should also be recognized in the material (noumenal) realm.",
                                "It seems an easier question to answer where your body is, where you physically are and of which dimensions. Indeed we have proper ways to measure such things (although I’d invite the reader to ponder what a measurement even is). However: with which detail?",
                                "The body is not a static entity but a dynamic ecosystem teeming with life. Consider the trillions of microorganisms that call your body home, from the bacteria in your gut to the fungi on your skin. We are not solitary beings but -mostly- symbiotic organisms, intricately connected to the web of life that surrounds us.",
                                "And yet, even within the confines of our own flesh, the boundaries of the self blur and dissolve. The distinction between self and other becomes increasingly nebulous as we delve deeper into the complexities of human biology. What is you and what is foreign? Are you your immune system? The bacteria on your skin? Your microbiota? Your blood? The water in it?",
                                "Old cells are continually replaced by new ones in a process of regeneration and renewal. With each passing moment, we shed fragments of ourselves into the world, leaving traces of our existence in the air we breathe, the food we eat, and the earth beneath our feet.                    Are we not but an eternal Theseus ship, whose planks are water and to the ocean return?",
                                "Even more atomically, our bodies are not separate from the cosmos but materially joint with it. We are stardust. We are made from universe and held together by it every breath, every step, every laugh and every tear.",
                                "When you look at your fingertips thinking “this is where my fingers end”, consider that even there, there are atoms of you further out, and atoms non-you further in. The bounds of the body are as the idea of the body itself, blurry, practical, yet purely conceptual.",
                                "When we look up at the night sky, we are not merely observers but participants in a dance of forever, in space and time. We see ourselves, past and future.",
                                "So when we ask the question, 'Who are you?' Let us not seek answers in the confines of identity or the boundaries of the body.                     Instead, let us embrace the boundless expanse of being, recognizing that we are not separate from the universe but integral parts of its ever-unfolding story.",
                                "When we ask “Who are you?” Let’s reply usefully, socially, with the information the asker needs, yet recognize that the true answer will forever melt between our fingers.",
                                "The real answer is simple. The real answer is freeing, liberating. The real answer is harmonious."
                            ]},
                            {"paragraph":[
                                "You do not exist."
                            ]}
                        ]
                    },
                    {
                        "title": "On The Limits of Communication: Only You Know What You Know",
                        "description": "Only you know what you know",
                        "image": "images/vlog_thumbnails/communication.png",
                        "contents": [
                            {"title": "Introduction"},
                            {"paragraph": [
                                "Talk. Code. Read. Write.",
                                "Draw. Sing. Move. Listen."
                            ]},
                            {
                                "image": "images/vlog_images/birds_singing.png",
                                "caption": "Man looking at mirror",
                                "link":"https://pixabay.com/photos/singing-birds-sing-nature-song-3948645/"
                            },
                            {"paragraph": [
                                "The joy of being heard, the connection in eye contact. Communication is the foundation of any social species. But at its core, it's only transmitting information.",
                                "Without communication there’s no understanding. No connection. Slow to non-existent progress. When I was a kid, I remember a moment where my mother asked me that question. It eventually led me to panic; for every answer I gave, there was a “but is that who you are?”. Who am I?",
                                "And yet when you ask me who someone else is, that is a most natural question, with quite simple answers."
                            ]},
                            {"paragraph": [
                                "We must communicate; however we often find ourselves struggling with the natural limitations to do so. Why?"
                            ]},
                            {"title": "What people teach will never be the same as what people want to learn."},
                            {"paragraph": [
                                "We’ve all been there. You’re sitting in a classroom, wondering about some detail of what the teacher has explained. You ask a question, and it feels like they’re answering an entirely different one, perhaps you’re so fortunate as to learn something new, but your confusion remains.", 
                                "At times, we’ve been on the flip side as well. A junior asks you a question on a topic you’ve already explained several times, you answer, and they nod ceremoniously, yet you both know that whatever the motive for their question, it pervades your teachings.",
                                "Despite the teacher's best efforts, the gap between what is taught and what is understood persists.",
                                "Frustrating, but why does that happen? Why does it continue to do so across cultures and vocations?"
                            ]},
                            {"title": "Context"},
                            {"paragraph": [
                                "Context. Symbols mean naught without context.                    Everything we know, we know within a set of constraints, assumptions and adjacent information.",
                                "This set is usually subtextual: it isn’t explicitly signaled anywhere in particular, nor are we even necessarily aware of its existence.                    Yet there is no thought in your mind which would be sensible without context; without the definitions of the words you use to enunciate it, the implicit assumptions you make or the things that you assume everyone must know.",
                                "The discrete nature of this contextual information is especially problematic for experts.                    When an expert communicates, they often presume that what they’re saying is obvious or common sense. To them it is, because their contextual knowledge is rich in that field, and so many of their observations are simple consequences of what they know.",
                                "We fail -all too frequently- to acknowledge that this context is precisely our expertise, and presuming that this information is widely shared effectively blocks our ability to understand each other, to work together, to hear one another, and to connect sincerely.",
                                "Context gets in the way of many other communication based tasks: conflict resolution is harder, when you don’t understand where the other side is coming from, culture is harder to appreciate with just a superficial (context-bare) view, collaboration is hampered by fundamental misunderstandings in the work that must be done or its costs.",
                                "On the other end, providing too much context on communicating is often wasteful: it takes time to share, takes time to consume, and most often does not even include the information that the other person actually wants. Even when we attempt to better communicate, we’re permanently impeded from reaching perfection.",
                                "Context makes us knowledgeable, yet it seems to impede so much in communicating with each other. We must ponder: is it the context? Or is it us?",
                                "I argue that it's not you (context), it's me."
                            ]},
                            {"title": "Only I know what I know:"},
                            {"paragraph": [
                                "People are complicated. We know many, many things.",
                                "However we don’t store our knowledge in shared memory. There is no factual hivemind.",
                                "You know what you know, and I know what I know.",
                                "But if I ask you “What do you know?”, expecting a list of all the information in your brain you’d find that most ridiculous.                    Even assuming that you could make such a list, you’d fail to communicate it properly (see title of article). But you can’t make such a list.",
                                "Why?",
                                "“What do you know?” falls, I think, into the same branch of inquiry as questions such as “Who are you?” (which I’ve explored in another article: “You Don’t Really Exist”)",
                                "For most of us, a sufficient limitation to entirely answer these questions is the vagueness of what the question means. What is “knowing” really? What is “me”?",
                                "Do I know something if I know where to find it? Do I know something if it has been taught to me by someone else? How can we be sure this other person knew it properly? What does it mean for them to know?",
                                "The question of what we know is by nature recursive ad nauseam. There is always the next step of “But how do we know that?” until we reach axiomatic assumptions. Axioms aren’t knowable, they’re simply assumed. So we can assume, and then we can infer from assumptions."
                            ]},
                            {"title": "We can never know"},
                            {"paragraph": [
                                "So… we can’t know things. Voila merci, thank you for your read, let us venture into the streets in cynical dread of our condemnation to eternal ignorance.",
                                "This is an unpragmatic interpretation.",
                                "I think that there is an alternative interpretation that I find not only infinitely more useful, and more interesting, but also sincerely quite freeing."
                            ]},
                            {
                                "image": "images/vlog_images/hummingbird.png",
                                "caption": "Man looking at mirror",
                                "link":"https://www.audubon.org/news/hummingbirds-shake-their-tail-feathers-generate-high-pitched-sounds"
                            },
                            {"paragraph": [
                                "Teaching, and indeed any communication, has never been about knowable things. It’s been -and I deem it will forever be- about persuading and convincing each other to exploit useful information, useful methods, useful tools, and useful practices to live better lives. To ask better questions, to solve more important problems.",
                                "Thinking of communication as the transfer of the truth is very humane arrogance. We can’t know the truth, not in any real way. But we can know the truth in many useful ways.",
                                "Children are excellently transparent with this. For any truth you hold undeniable, they will seamlessly challenge it, with no malice but simple curiosity: because nothing you know is truly undeniable."
                            ]},
                            {"paragraph": [
                                "But what does all of this tell us about communicating with each other?",
                                "If there is no real fundamental knowledge, but rather just useful snippets, what are we even doing?"
                            ]},
                            {"title": "Conclusion: we do our best. But not the best."},
                            {"paragraph": [
                                "We know nothing, and yet we still… talk. We talk and we write and we sing and we try.",
                                "We communicate our know hows, our warnings, our tales, our stories and advice.",
                                "We communicate to help each other; to help ourselves.",
                                "We do our best."
                            ]},
                            {"paragraph": [
                                "Yet, let us be permanently conscious: we will never communicate the best way.",
                                "We can’t, so let us be humble. Let us converse, let us keep trying.",
                                "To be imperfect gives us power in iteration, in retrying, in back and forths."
                            ]},
                            {"paragraph": [
                                "Let’s keep helping each other, but next time a student raises their hand, remember: they can’t ask the perfect question, and you can’t tell them exactly what they want.",
                                "But it's better if you try."
                            ]},
                            {
                                "image": "images/vlog_images/helping_hand.png",
                                "caption": "Man looking at mirror",
                                "link":"https://www.pinterest.com/pin/634937247461784490/"
                            }
                        ]
                    },
                    {
                        "title": "Aim to do, not to be.",
                        "description": "Reflections on the frame of mind that has given me peace and what I deem healthy, sustainable growth.",
                        "image": "images/vlog_thumbnails/compass.jpeg",
                        "contents": [
                            {"title": "Aim to do, not to be."},
                            {
                                "image": "images/vlog_images/self.webp",
                                "caption": "Illustration by Zoe Liu in How Our Brain Preserves Our Sense of Self - Scientific American",
                                "link":"https://www.scientificamerican.com/article/how-our-brain-preserves-our-sense-of-self/"
                            },
                            {"paragraph":[
                                "What do you want to be when you grow up?",
                                "Who are you?"
                            ]},
                            {"paragraph":[
                                "Why do we bother answering these questions?",
                                "What is it that we’re really trying to understand with them? ",
                                "My thesis is that we seek a shortcut description of people: “Oh, this guy is A, this guy is B.”",
                                "It makes it easier to talk about ourselves and others, reducing our identities to simple labels."
                            ]},
                            {"paragraph":[
                                "But here’s the thing—asking who we want to be is a misstep, a misunderstanding.",
                                "It’s like mistaking the photo for the person.",
                                "Identity is a momentary snapshot, something fluid and ever-changing.",
                                "Rather than fixating on capturing the perfect photo—as we’ve grown accustomed to doing—I’d argue that the more powerful framework is to dance the best we can."
                            ]},
                            {"title": "Build."},
                            {
                                "image": "images/vlog_images/beaver.jpg",
                                "caption": "Beaver chilling in its dam",
                                "link":"https://www.brainson.org/episode/2023/09/19/how-do-animals-build-their-homes"
                            },
                            {"paragraph":[
                                "Prioritize. Make music over being a musician. Do sport over being an athlete. Build things over being an engineer. Discover and wonder over being a scientist. Focus on the act, the experience, the joy of doing."
                            ]},
                            {"paragraph":[
                                "For instance, consider the difference between “being a musician” and “making music.”",
                                "The first is a title, an abstraction of expectations.",
                                "The second is a freedom, an experience, a good idea, a relaxed afternoon.",
                                "When you prioritize making music, you allow yourself to explore, to fail, to grow—without the pressure of living up to the title of “musician.”"
                            ]},
                            {"paragraph":[
                                "If perfect is the enemy of good, then expectation is the enemy of action. And action is the path to growth. In action and growth you build the constant self that you want to be. Build things, build your life and build yourself: there's no more important project than you, because without you there is nothing else to do."
                            ]},
                            {"paragraph":[
                                "So, love and play. Do things. Aim to do, not to be. In doing so, you might find that the labels—if they matter at all—will follow naturally, shaped by the richness of your experiences."
                            ]}
                        ]
                    },
                    {
                        "title": "On Emergent Behaviors",
                        "description": "Thinking about some of the ways simple rules generate our chaotic world.",
                        "image": "images/vlog_thumbnails/emergent_behavior.webp",
                        "contents": [
                            {"paragraph":[
                                "Rule 1: Don't talk about fight club.", 
                                "Rule 2: No weapons.", 
                                "Rule 3: Don't talk about fight club.",
                                "Anarchy ensues."
                            ]},
                            {"title": "On Emergent Behaviors."},
                            {
                                "image": "images/vlog_images/emergence.jpg",
                                "caption": "Cheese Balls, Napanoch, New York, 2012 - Part of the Emergent Behavior collection from Thomas Jackson",
                                "link":"https://www.thomasjacksonphotography.com/emergent-behavior.html"
                            },
                            {"paragraph":[
                                "An atom jiggles in space. It jiggles not alone but with friends. They’re more jiggly than usual and you burn up in a fever. They’re less jiggly and you freeze. Some jiggle here, others there."
                            ]},
                            {"paragraph":[
                                "Some jiggle right in the gap where synapses happen, making up your cerebrospinal fluid—these jiggling atoms keep you alive. Others jiggle slightly to the side, arranged in a very convenient way, forming groups of atoms (a.k.a Jiggle Boy Bands) that we call molecules.",
                                "The name comes from the number of atoms in a molecule, but I won’t take up a Mole's time to explain."
                            ]},
                            {"paragraph":[
                                "These molecules hang out. They’re chilling, vibing even. They, like words in a sentence, just happen to arrange into a cell.",
                                "The cells themselves are arranged in quite a smart way, and we call it a Neuron. If they break in a specifically evil way, we call it Cancer."
                            ]},
                            {"paragraph":[
                                "We call this group jiggle temperature. With this alone, we already start to see significant complexity emerge: you can have cold neurons or hot neurons, cold cancer or hot cancer. You can have cells made of these molecules or those other molecules. You can have something here or something there."
                            ]},
                            {"paragraph":[
                                "Already, with just a few simple things to keep in mind, there’s so much to discover."
                            ]},
                            {"paragraph":[
                                "Such little things, with such simple rules at their essence."
                            ]},
                            {"paragraph":[
                                "Yet when we stack layers upon layers of simplicity, we get life. We get everything. It might seem surprising, but the math makes it quite obvious.",
                                "If you have n layers, with Xn rules each, then you naively have a total of X1 * X2 * ... * Xn rules in total.",
                                "That’s a lot of rules that can define so many different combinations!"
                            ]},
                            {"paragraph":[
                                "What is life? My suspicion is that the word in itself is simply a classifier. Our brain simplifying the world to our great benefit in living, but to our great detriment in understanding."
                            ]},
                            {"paragraph":[
                                "I think life is no one thing. I think life is this permutation of wildly varied and rich rules.",
                                "Life is the combination of all these little things that happen, and that sometimes permute into bigger things that our brain perceives and classifies. Life is when we go “oo that's alive”."
                            ]},
                            {"paragraph":[
                                "There also exist scientific definitions of what life is, but science itself is when we go “oo that’s science”.",
                                "Of course, it's less subjective than your taste in music, but it isn’t much more objective than a combination of all of our subjectivities. Opinions and ideas mixed with measurements, which ultimately we can only consume through our senses.",
                                "Monkeys trying to do our best to disassociate with your sensorial organs to see some higher truth. It’s quite the struggle: even in the previous sentence we fall back to the senses, we try to see."
                            ]},
                            {"paragraph":[
                                "What is intelligence? I think the answer is indeed quite similar: intelligence is I see something and think it think. Monkey see, monkey classify.",
                                "But let’s go beyond the word, what is this idea of intelligence? (Such platonic idealism that we indulge in)"
                            ]},
                            {"paragraph":[
                                "I think intelligence is also just a combination of rules. In us, it's the rules up to the layer of abstraction of the brain, or sometimes of the combination of brains in many brainees: people or otherwise."
                            ]},
                            {"paragraph":[
                                "Well then, how come we would ever believe that only us get to be intelligent? Is that not some great -unfounded- arrogance? Some terribly humane hubris?",
                                "And why would we ever think we can’t make intelligence? It's just combinatorics, not rocket science.",
                                "Today we’re trying by combining rules of computing and statistics, because we’ve sensed it to work better than other things we’ve tried (yes, science seems to mostly be fucking around and finding out) but those are just some arbitrary sets of rules we use. If there’s a limit to those, we can use others."
                            ]},
                            {"paragraph":[
                                "We come from jiggly guys, is it so hard to imagine other things coming from us?"
                            ]},
                            {"paragraph":[
                                "It’s all just… emergent behaviors."
                            ]}
                        ]
                    },
                    {
                        "title": "Be Good And Great",
                        "description": "A reminder to aspire for growth, but to not grow crooked.",
                        "image": "images/vlog_thumbnails/good_and_great.jpeg",
                        "contents": [
                            {"paragraph":[
                                "In one of Kafka's tales, he tells us of many sons, many sons archetypal for many men.",
                                "Each remarkable in its own way, one tremendously charming, another greatly intelligent, another beautiful as to offend the olympians.",
                                "Yet none of these have the sincere charm that I find in the 'unremarkable' one.",
                                "Unremarkable, naive, not quite bright, and yet he is kind.",
                                "It is he, who leads the best life."
                            ]},
                            {"title": "Be Good And Great."},
                            {
                                "image": "images/vlog_images/trees.jpg",
                                "caption": "Dragon's Blood Tree, The Millennial Tree of Socotra Island",
                                "link":"https://mybestplace.com/en/article/dragons-blood-tree-the-millennial-tree-of-socotra-island"
                            },
                            {"paragraph":[
                                "I want more."
                            ]},
                            {"paragraph":[
                                "Don’t we all?"
                            ]},
                            {"paragraph":[
                                "There’s always more.",
                                "Desire is a barrel with holes, which we fill and fill and fill, only to watch it leak and leak and leak.",
                                "Growth is paradoxically both desirable and poisonous. It's a drive, a fuel that pushes us forward, a change, a betterment.",
                                "Yet, like many trees, it's all too easy to grow crooked."
                            ]},
                            {"paragraph":[
                                "To grow, we must first be very sure of the direction we’re growing in. Without a clear direction, we risk not growing at all but simply wandering aimlessly."
                            ]},
                            {"paragraph":[
                                "On the other hand, the temptation not to grow, not to change, can be just as dangerous.",
                                "Staticity has a certain charm, but it’s a comfort steeped in toxicity.",
                                "We all must be continuously in motion, at the very least to match the tides of the earth and the life around us.",
                                "When life stops moving, we call it a corpse. To live is to move. And to move is to change.",
                                "If we’re going to change, then let’s do it purposefully: let’s grow."
                            ]},
                            {"paragraph":[
                                "However, we often fall into the trap of assuming we are good simply because we do no harm. This perception is misguided: being harmless is not the same as choosing to do no harm."
                            ]},
                            {"paragraph":[
                                "Is it good to do what people tell you to do? To follow what others declare as good?",
                                "History has shown us many times that this isn’t true, and the lessons are carved in blood.",
                                "Is one truly good if they lack the strength to go against societal expectations? Or is that just compliance?"
                            ]},
                            {"paragraph":[
                                "The only real way to grow is to do both: to acquire strength and to direct it properly.",
                                "True growth requires cultivating oneself in three dimensions: competence, the power to do things (distinct from what we often call power, which I would term corruption), and the spirit—the heart and soul."
                            ]},
                            {"paragraph":[
                                "Only by developing in these areas can we find the right direction and grow firmly along it.",
                                "Only then can we truly be good and use our greatness to propel us forward on the right path."
                            ]},
                            {"paragraph":[
                                "To ensure your growth is purposeful, regularly assess your direction. Ask yourself:"
                            ]},
                            {"list":[
                                "Am I growing in the right way?",
                                "Am I cultivating the right strengths?",
                                "Am I challenging societal expectations when they conflict with my principles?"
                            ]},
                            {"paragraph":[
                                "Reflect on these questions and adjust your course as needed. True growth is intentional and guided by a well-developed sense of direction and integrity."
                            ]},
                            {"paragraph":[
                                "I won’t give you specifics. You already know what you should be doing.",
                                "Do better. Be great."
                            ]}
                        ]
                    }
                ]
        }
    },
    "es": {
        "languages":["ingles", "español", "frances"],
        "personal": {
            "journey": {
                "title": "Hola! 👋",
                "description": [
                    "Soy /h Santiago, tremendamente mexicano, y soy un /h Ingeniero /h de /h Software.",
                    "Disfruto leer, programar, hacer musica, crear, enseñar, aprender, escribir y andar en bici. Y los parques. Y museos. La vida es un gusto que tengo bien adquirido.",
                    "Opino que las acciones hablan mas que mil palabras, así que si gustas te invito a explorar este sitio y ve lo que hago, lo que he hecho, lo que escribo y lo que pienso.",
                    "Y si eso es demasiada molestia: si solo pudiesen usar 1 palabra, mis amigos me describirian como inusual, si les agraciamos con 2 le sumarían contradictorio, y si les regalamos 3 espero que admitirian que soy tremendisimamente gracioso.",
                    "Dicen que eres lo que comes, asi que he aqui un poco de mi dieta:"
                ]
            },
            "books": [
                "images/books/anElegantDefense.jpg",
                "images/books/immune.jpeg",
                "images/books/whenTheBodySaysNo.jpeg",
                "images/books/gunsGermsAndSteel.jpg",
                "images/books/theJakartaMethod.jpg",
                "images/books/crimeAndPunishment.jpg",
                "images/books/manSearchForMeaning.jpg",
                "images/books/madameBovary.jpg",
                "images/books/aHundreadYearsOfSolitude.jpg",
                "images/books/theFeastOfTheGoat.jpg",
                "images/books/capital.jpeg",
                "images/books/theTyrannyOfMerit.jpg",
                "images/books/braidingSweetgrass.jpeg",
                "images/books/thinkingFastAndSlow.jpg",
                "images/books/1984.jpg",
                "images/books/braveNewWorld.jpg",
                "images/books/fahrenheit451.jpg",
                "images/books/hitchikersGuide.jpeg",
                "images/books/understandingPower.jpeg",
                "images/books/anna_karenina.jpeg",
                "images/books/brothers_karamazov.jpeg",
                "images/books/how_to_solve_it.jpg",
                "images/books/lotr.jpeg",
                "images/books/metamorphosis.jpeg"
            ],
            "movies": {
                "posters": [
                    "images/movies/wall-e.png",
                    "images/movies/theIronGiant.png",
                    "images/movies/spiderverse.png",
                    "images/movies/pussInBoots.png",
                    "images/movies/coco.png",
                    "images/movies/howlsMovingCastle.png",
                    "images/movies/laVieEstBelle.png",
                    "images/movies/ladyBird.png",
                    "images/movies/moonlight.png",
                    "images/movies/roma.png",
                    "images/movies/pansLabyrinth.png",
                    "images/movies/whiplash.jpeg",
                    "images/movies/blackSwan.png",
                    "images/movies/1917.png",
                    "images/movies/joker.png",
                    "images/movies/parasite.png",
                    "images/movies/requiem.png",
                    "images/movies/theShining.png",
                    "images/movies/trainspotting.png"
                ]
            },
            "albums": {
                "covers": [
                    "images/albums/21-savage_i-am-i-was.png",
                    "images/albums/black-keys_el-camino.jpeg",
                    "images/albums/brockhampton_saturation.png",
                    "images/albums/gorillaz_2001.png",
                    "images/albums/kenny-beats_louie.jpeg",
                    "images/albums/little-simz_no-thank-you.jpeg",
                    "images/albums/mac-miller_faces.jpeg",
                    "images/albums/the-strokes_the-new-abnormal.png"
                ]
            }
        },
        "professional": {
            "work": {
                "title": "Proyectos que he realizado.",
                "positions" : [
                    {
                        "place": "Figma, 2023 - Presente",
                        "title": "Ingeniero de Software: Infraestructura",
                        "description" : [
                            {"paragraph": "Me he ganado la reputación de aprender rápido y cumplir con las tareas. Mi trabajo incluye:"},
                            {
                                "list": [
                                    "Migración del backend de nuestra API REST; esto fue una parte de un proyecto de desmantelamiento de servicios que ahorró $18M al año.",
                                    "Construcción de infraestructura esencial para las funciones de búsqueda con IA.", 
                                    "Actualmente, estoy trabajando en nuestra tecnología multijugador en Rust/Typescript para la colaboración en tiempo real."
                                ]
                            },
                            {"paragraph": "Estoy orientado a resultados, mis herramientas varían, pero he utilizado principalmente: Ruby, Rust, TypeScript, React, Terraform y AWS, así como algo de Kubernetes."}
                        ],
                        "image": "images/experience/figma.png"
                    },
                    {
                        "place": "Universidad de Montreal, 2021 - 2023",
                        "title": "Asistente de Enseñanza e Investigación.",
                        "description" : [
                            {"paragraph": "Desde el momento en que llegué a Montreal hasta que me fui a Nueva York, trabajé como asistente de enseñanza durante 2 años, con alrededor de 1650 estudiantes (sin contar las coincidencias):"},
                            {
                                "list": [
                                    "Programación 101 con Python (durante 3 semestres)",
                                    "Conceptos y paradigmas de lenguajes de programación (durante 2 semestres)", 
                                    "Estructuras discretas en ciencias de la computación (2 semestres)",
                                    "Desarrollo y diseño web (2 semestres)", 
                                    "Ingeniería de software", 
                                    "Conceptos avanzados de Java"
                                ]
                            },
                            {"paragraph": "Un GRAN agradecimiento - tanto por soportar esa experiencia conmigo como por guiarme a través de ella - a: Marc Feeley, Olivier Melançon, Stefan Monnier, Miklós Csűrös, Sébastien Roy, Amal Ben Abdellah y Michel Reid."}

                        ],
                        "image": "images/experience/Paradigms.jpg"
                    },
                    {
                        "place": "Ixiasoft",
                        "title": "Desarrollador Full Stack - interno, 2022",
                        "description" : [
                            {"paragraph": "Durante el verano de 2022: Implementé características experimentales, documenté y depuré la aplicación web DITA CCMS de Ixiasoft para documentación técnica. Principalmente trabajé con:"},
                            {
                                "list": [
                                    "Java",
                                    "TypeScript", 
                                    "React y Redux", 
                                    "Apache", 
                                    "Maven", 
                                    "CSS"
                                ]
                            }
                        ],
                        "image": "images/experience/fullstack.jpg"
                    }
                ]
            },

            "education": {
                "title":"Places where I've studied.",
                "classHeader":"Some of my favorite classes:",
                "schools" : [
                    {
                        "name": "Université de Montréal",
                        "image": "images/institutions/UdeM.jpeg",
                        "degree": "Bachelors of Science, Computer Science",
                        "details": "Montreal | 2020-2023",
                        "abreviation": "UdeM",
                        "description": 
                        [
                            "I did my honors project on genome assembly scaffolding with paired sequencing reads -which is a fancy way of saying: I arranged DNA snippets to build a genome, its hard because the snippets are messy, faulty, and could go anywhere... so how do you know where to put them? The snippets I studied were from an Agrobacterium, which is a bacteria that makes plants sick =(. I was also a consulting director at 180DC UdeM."
                        ],
                        "classes": [
                            "Data Science",
                            "Operating Systems",
                            "UI/UX",
                            "Data Structures",
                            "Algorithms",
                            "Data Science",
                            "Quantum Informatics",
                            "Databases",
                            "Machine Learning",
                            "3D Computer vision",
                            "Linear Algebra",
                            "Genetics"
                        ]
                    },
                    {
                        "name": "Lycée franco-mexicain",
                        "image": "images/institutions/LFM.jpeg",
                        "degree": "French Baccalaureat, Engineering Science",
                        "details": "Mexico | 2017-2020",
                        "abreviation": "LFM",
                        "description": [
                            "I went on the Science track, specialized in maths and engineering, and finished with a mention très bien: TB -which was the highest honors available at the school-, I was a candidate to the concours general in mathematics, physics and engineering (only the best of each school are allowed to participate). I founded and  led the Machine Learning club, and I was in the Programming Club"
                        ],  
                        "classes": [
                            "Advanced Maths",
                            "Engineering Sciences",
                            "French",
                            "English",
                            "Spanish",
                            "German"
                        ]
                    }
                ]
            },
            "projects": 
            {
                "title":"Academic and Personal Projects",
                "projects": [
                    {
                        "title": "Multithreaded web server",
                        "description": [
                            "Built a Multithreaded web server using Rust! It's the final project in the Rust book, and I figured it'd be the best way to get acquainted with the language."
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/rust.jpg"
                    },
                    {
                        "title": "Orball",
                        "description": [
                            "Learned to make 2D games using Godot and gdscript. Didn't bother to finish it, but I did implement some procedural generation and per-chunk incremental loading (this prevents the typical case where you open a game and its very slow to boot up) that I'm happy with. You can play it, but honestly it aint a fun game!",
                            ""
                        ],
                        "link": "https://gfecito.itch.io/orball?secret=GNoDj8sJ0n9m71KTTVJOJrjcjD8",
                        "websiteLabel":"Play it now (move with WASD; eat by holding down E)",
                        "image": "images/projects/Orball.jpg"
                    },
                    {
                        "title": "Looks",
                        "description": [
                            "Built the prototype for a clothing-oriented social media platform and app using Swift (with SwiftUI and UIKit), Typescript, Firebase. I built the iOS prototype, an admin page, a waitlist/promo site, as well as setting up our DB, compute, permissions and a connection to Amazon via API.",
                            ""
                        ],
                        "link": "https://looks-waitlist.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/looks.png"
                    },
                    {
                        "title": "AI for Climate",
                        "description": [
                            "This project, under Mila - Quebec AI Institute, aims to improve climate modeling for weather forecasting, agriculture, and more. Current models struggle with unreliable small-scale data. As project manager and core contributor, I organized our team to enhance these models with state-of-the-art solutions, made a dedicated website and worked on our data pre-processing for the models.",
                            ""
                        ],
                        "link": "https://climate-model-downscaling.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/MLClimate.png"
                    },
                    {
                        "title": "Genomics",
                        "description": [
                            "This is a research and development project for UdeM's Laboratory of Computational and Theoretical Biology. Researched and implemented an API for genome assembly refinement, as well as a binning scheme data structure, using JAVA and the htsjdk library. The work is thoroughly documented and explained here:",
                            ""
                        ],
                        "link": "https://genome-assembly-scaffolding.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Genomics.jpeg"
                    },
                    {
                        "title": "AI 3D Computer-Vision",
                        "description": [
                            "This project for UdeM's Laboratory of 3D Computer Vision involved implementing CNN architectures based on GC-Net for binocular stereoscopy using Mathematica. I focused on depth variations, residual nets, estimation quality, and computational expense. Code and models are available online.",
                            ""
                        ],
                        "link": "https://github.com/Gfecito/GC-Neat",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Disparity.png"
                    },
                    {
                        "title": "ML Models",
                        "description": [
                            "I developed machine learning models for supervised tasks using Python, implementing KNN, Parzen Windows, perceptrons, and SVMs from scratch, and using libraries for neural networks and CNNs. I tested these models on regression and classification problems with datasets including bank records, phone records, and MNIST.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/ML.png"
                    },
                    {
                        "title": "File Management System",
                        "description": [
                            "We implemented a 'File Allocation Table'-based storage management system using C for a 32-bit Linux system. In human talk: we built the file -and memory- management section of an operating system.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/FAT32.jpeg"
                    },
                    {
                        "title": "Database",
                        "description": [
                            "Planned then built a small database for a library. In the planning, we used formal methods for entity-relationship modelling, then relational modelling, relational algebra, request optimization and database normalization. For the implementation, we used SQL, Hibernate (Java) and Maven for compilation and delivery of the executable.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Database.jpeg"
                    },
                    {
                        "title": "Gesture Recognition Web-App",
                        "description": [
                            "Partitioned and preprocessed a database, built and trained a convolutional neural network model, exported and then implemented it into a dynamic web platform. I built the latter using Flask (Python) and Jinja.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/GestureRecognition.gif"
                    },
                    {
                        "title": "Vaccination Management",
                        "description": [
                            "I developed a Java app with an interactive graphical interface and a data management system. The process included engineering planning, interviews, prioritization, use case definitions, risk analysis, non-functional requirements, constraints, VPP modeling, design, prototyping, automatic testing with JUnit, team management, scheduling, and documentation with Javadoc.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Vaccination.png"
                    },
                    {
                        "title": "21st Century Abacus",
                        "description": [
                            "School project for object-oriented programming with Java; it's a small window. Using JavaFX, we (2 people) made a fancy window with 2 counters: you can add and subtract, divide and multiply, undo and redo. Every action performed in the app was temporarily saved, and as such the actions log was always available for exporting as a .txt file.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/CounterThumbnail.png"
                    },
                    {
                        "title": "Interpreters",
                        "description": [
                            "A Pseudo-Lisp interpreter made with Haskell: Built the interpretation and evaluation section of a Haskell program that could read and execute files from a Lisp-inspired language. Dealt with functions, closure, environments, variables, recursion and recursive definitions, etc... the whole enchilada. Then built a Pseudo-Haskell interpreter, where I used Prolog for interpreting and executing, same features as before, but with added type inference.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Interpreter.png"
                    },
                    {
                        "title": "Environnemental Simulation",
                        "description": [
                            "Using object-oriented programming we made an environmental simulation program. It read XML files describing animals or plants and simulated them for a certain amount of epochs: the way they interacted, what they ate, their energy consumption, whether they died or reproduced, and so on.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/WildLionSimulator3D.jpeg"
                    },
                    {
                        "title": "This site!",
                        "description": [
                            "Originally made from scratch with HTML, CSS, JavaScript, jQuery as well as the Animate on Scroll library. Currently built with React, TypeScript, JSON, CSS... and a sprinkle of love!"
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/ThisSite.jpeg"
                    }
                ]
            },
            "awards": {
                "title":"Awards",
                "dateLabel":"Date: ",
                "awards": [
                    {
                        "title":"ICPC NE-NA",
                        "date":"February 2023",
                        "description":[
                            "The 2nd best team in DIRO's history in this prestigious programming competition",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"DIRO's excellence scholarship",
                        "date":"December 2021",
                        "description":[
                            "Excellence scholarship awarded to the top bachelor students in the DIRO (Department of Computer Science and Operations Research)",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"Exemption Scholarship for international students",
                        "date":"August 2020",
                        "description":[
                            "Biggest merit-based scholarship for international students at the Université de Montréal",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"French regional math olympiads | Best team, Top 3 individual",
                        "date":"2019",
                        "description":[
                            "My region spanned from Mexico to Panama, and included all french teaching institutions there."
                        ],
                        "image":"images/trophy.png"
                    }
                ]
            }
        },
        "articles": {
            "title":"Cosas que pienso. Cosas que escribo.",
            "closeArticleLabel":"Cerrar articulo",
            "scrollLabel":"Ir hasta abajo",
            "articles":
                [
                    {
                        "title": "Sobre Aprender y Enseñar",
                        "description": "Reflexiones sobre cómo estudiar, aprender y enseñar de manera efectiva.",
                        "image": "images/vlog_thumbnails/teacher_in_class.jpeg",
                        "contents": [
                            {"title": "Sobre aprender y enseñar."},
                            {
                                "image": "images/vlog_images/dead_poets_society.jpg",
                                "caption": "Robin Williams como John Keating en La sociedad de los poetas muertos",
                                "link":"https://www.huffpost.com/entry/the-dead-poets-society-gu_b_749665"
                            },
                            {"paragraph":[
                                "En este artículo compartiré lo que he aprendido, tanto como estudiante como profesor a lo largo de los años. El enfoque principal será encontrar enfoques efectivos para aprender, así como enfoques efectivos para enseñar.",
                                "Para una perspectiva objetivamente más completa, recomendaría encarecidamente el libro de G. Polya, “How to Solve It”, que es un libro fantástico tanto sobre la enseñanza como sobre el aprendizaje del arte de resolver problemas."
                            ]},
                            {"paragraph":["Cuando menciono buenos profesores a lo largo del artículo, hay un reconocimiento implícito de que existen malos profesores. Los malos profesores, creo, son buenos profesores en potencia; porque la enseñanza en sí misma se aprende."]},
                            {"title": "Práctica efectiva:"},
                            {"paragraph":["La práctica hace al maestro. Bueno, no del todo, pero la práctica sí mejora. Siento que la parábola de la clase de cerámica lo ilustra de la forma más sucinta:"]},
                            {"quote":
                                "Había una vez un profesor de cerámica llamado Brian. Un mes, decidió dividir su clase en dos grupos. El Grupo A tenía que hacer una maceta todos los días durante 30 días (así que 30 macetas en total). El Grupo B tenía que trabajar en una sola maceta durante los 30 días completos. Al final del mes, Brian juzgó la calidad de las macetas. Sin excepción, todas las 10 mejores macetas provenían del Grupo A, los chicos que hacían una maceta por día. Ninguna provenía del grupo que se enfocó en perfeccionar su única maceta."
                            },
                            {"paragraph":[
                                "Los estudiantes que buscan mejorar necesitan practicar a fondo. La Práctica Deliberada es generalmente el mejor enfoque y ya está bien documentada: practica, pero hazlo con un plan."
                            ]},
                            {"paragraph":[
                                "En particular, tomando prestado de Polya, un buen enfoque para la Práctica Deliberada es hacer múltiples intentos, de manera iterativa, basándose en sus 4 principios: entender el problema, hacer un plan, ejecutar el plan, revisar tu trabajo."
                            ]},
                            {"paragraph":[
                                "En mi experiencia, la mayoría de los estudiantes fallan en al menos uno de estos. Creo que esto es un fracaso de los profesores al no comunicar (o quizás no entender) que estos mismos principios son las razones por las que educamos de la manera en que lo hacemos:"
                            ]},
                            {"list":[
                                "Clase/Demostración: entender el problema.",
                                "Instrucciones: hacer un plan (cuanto más vagas sean las instrucciones, más de esto se delega al estudiante).",
                                "Tareas: ejecutar el plan.",
                                "Calificaciones, exámenes, retroalimentación: revisar tu trabajo."
                            ]},
                            {"paragraph":[
                                "Siendo un estudiante que no está familiarizado con estos principios, la escuela parece tonta y a menudo arbitraria en sus formas.",
                                "Como profesor, no conocer estos principios podría llevar a una dinámica que, a menudo, puede ser bastante infructuosa tanto para los estudiantes como para el profesor.",
                                "Piensa en las películas clásicas durante la escuela secundaria, o en largos desvíos durante las clases: entretenido, pero el tiempo se aprovecharía mejor haciendo eso con amigos que con un viejo desconocido.",
                                "Buscamos un profesor para que nos enseñe: no querrías que tu médico retrasara la cirugía para hablar de su divorcio."
                            ]},
                            {"paragraph":[
                                "Naturalmente, podrías haber notado que no todo es igualmente fácil de practicar.",
                                "Podrías pensar en aprender inglés, donde estás severamente en desventaja: los padres de tus compañeros lo hablan, y pueden practicar fácilmente en casa, ¡pero tú no puedes!",
                                "O matemáticas, cuando su hermano es contador y puede guiarlos a través de los 4 principios.",
                                "Incluso hay algunas cosas que podrían parecer impracticables: como cómo hacer un examen o hacer un salto mortal hacia atrás."
                            ]},
                            {"paragraph":[
                                "Aquí es donde debemos ser creativos. Si para aprender efectivamente debemos practicar una y otra vez, entonces debemos encontrar una manera de convertir cualquier tema que se pueda aprender en un tema que se pueda practicar. He observado que para hacer posible la Práctica Deliberada, necesitamos dos ingredientes:"
                            ]},
                            {"list":[
                                "Un espacio seguro para fallar.",
                                "Retroalimentación sólida: la retroalimentación sólida es rápida, frecuente y accionable."
                            ]},
                            {"paragraph":[
                                "Los juegos hacen esto excelentemente, y notarás que los jugadores que juegan más típicamente son significativamente mejores que aquellos que juegan menos. Esto se debe a que los juegos están hechos de una manera que optimiza para la práctica efectiva:"
                            ]},
                            {"list":[
                                "Si fallas, puedes jugar de nuevo y estarás bien (es seguro).",
                                "Cuando fallas, lo sabes inmediatamente y puedes intentarlo de nuevo (Retroalimentación Sólida)."
                            ]},
                            {"paragraph":[
                                "Construir un espacio seguro para la práctica y crear una línea de retroalimentación sólida ha sido históricamente bastante desafiante (de ahí que las escuelas excelentes sean raras). No conozco ninguna receta generalizable, pero aquí hay algunos ejemplos:"
                            ]},
                            {"list":[
                                "Construir un espacio seguro: para aprender a hacer exámenes, uno podría tomar una muestra de muchos exámenes de la biblioteca o de internet y practicar en casa, replicando las condiciones del examen (silencio, limitaciones de tiempo, limitaciones de documentación) y evaluarse a sí mismo (o hacerlo con un amigo, generalmente con mejores resultados).",
                                "Construir un espacio seguro: para aprender a hacer saltos mortales hacia atrás, uno podría instalar almohadillas y un entorno físico donde sea menos probable que te lastimes. Sería preferible hacer que una lesión grave sea casi imposible al tener a un experto guiándote y cuidándote.",
                                "Retroalimentación sólida: un estudiante podría tomar exámenes de práctica que intentó por sí mismo, y ya calificados por su maestro, pidiendo consejo.",
                                "Retroalimentación sólida: hoy en día, aunque uno debe ser muy escéptico y cuidadoso con esta herramienta, un estudiante puede iterar con un modelo de lenguaje GPT para obtener retroalimentación sobre su trabajo/ideas. Esto funciona sorprendentemente bien, lo que atribuiría a que internet está lleno de foros con preguntas similares, y respuestas ponderadas que funcionan como retroalimentación."
                            ]},
                            {"paragraph":[
                                "Los buenos profesores crearán un espacio seguro para fallar en sus clases y proporcionarán constantemente retroalimentación sólida.",
                                "Los buenos profesores también reprobarán a los estudiantes que no hayan asimilado el material, con la intención de darles más tiempo para hacerlo. Un espacio seguro no es un espacio fácil, pero es seguro: si se deja ir a un estudiante sin la preparación adecuada, eventualmente fallará en un espacio donde no es seguro hacerlo."
                            ]},
                            {"title": "Lo abstracto y lo concreto."},
                            {
                                "image": "images/vlog_images/abstract_vs_concrete.png",
                                "caption": "El desarrollo de patrones de pensamiento abstracto y concreto por Iryna Horkovska",
                                "link":"https://calmerry.com/blog/psychology/the-development-of-concrete-and-abstract-thinking-patterns/"
                            },
                            {"paragraph":[
                                "¡Genial! Ahora podemos aprender cosas nuevas. Pero, ¿cómo las recordamos?"
                            ]},
                            {"paragraph":[
                                "Lo siguiente es una simplificación del funcionamiento del cerebro, pero suficiente para nuestro propósito de aprender mejor:",
                                "El cerebro funciona a través de asociaciones: cuanto más fuerte es la asociación, más poderosa es la conexión. En el aprendizaje, la fuerza de estas conexiones parece ser proporcional al número de veces que se realiza la asociación y cuán interesante la encontramos.",
                                "¡Un recuerdo que está fuertemente vinculado a un evento será recordado cuando el evento ocurra!",
                                "(Piensa en la brisa acariciando la hierba que viene a la mente con el sonido del viento, o en la pura ira al ver un lobby de League of Legends con ese tipo con el que jugaste hace un año)."
                            ]},
                            {"paragraph":[
                                "Genial. Aprovechemos eso."
                            ]},
                            {"paragraph":[
                                "Hazlo interesante: Inyectar elementos de interés asegura que la información se destaque en tu mente. Esto podría involucrar el uso de imágenes vívidas, narraciones o analogías del mundo real que capturen tu atención."
                            ]},
                            {"paragraph":[
                                "Hazlo relacionado/coherente: La asociación debe tener sentido y ser fácil de recordar. Es como crear un mapa mental: cada paso lleva lógicamente al siguiente, lo que facilita la recuperación si olvidas al principio."
                            ]},
                            {"paragraph":[
                                "Hazlo repetitivo: Practica y revisa constantemente el contenido. La repetición, especialmente a lo largo del tiempo, fortalece las conexiones en el cerebro y ayuda a retener la información a largo plazo."
                            ]},
                            {"paragraph":[
                                "Refuerza las asociaciones: Reforzar las conexiones con elementos que ya conoces. Cuantas más conexiones puedas hacer, más anclada estará la nueva información en tu cerebro. "
                            ]},
                            {"paragraph":[
                                "Esto es algo fundamental en el aprendizaje efectivo. Mientras mayor sea la estructura de conocimiento que se relaciona con lo que estás aprendiendo, más fácil será recordarlo y aplicarlo."
                            ]},
                            {"paragraph":[
                                "Esto me lleva a una distinción que hacemos entre la enseñanza de ideas abstractas y concretas. Para ilustrar esto, considero a un estudiante de programación que necesita aprender lo siguiente:"
                            ]},
                            {"list":[
                                "Cosas concretas: La sintaxis de un lenguaje de programación, herramientas específicas, IDE, etc.",
                                "Cosas abstractas: Patrones de diseño, principios de arquitectura de software, etc."
                            ]},
                            {"paragraph":[
                                "En mi experiencia, las cosas concretas son cosas que no puedes enseñarte a ti mismo. Las cosas abstractas, por otro lado, a menudo puedes enseñarte a ti mismo con facilidad."
                            ]},
                            {"paragraph":[
                                "Por ejemplo, uno podría aprender sintaxis leyendo un libro o siguiendo tutoriales en línea. Puede que no lo entiendas de inmediato, pero con la práctica, lo conseguirás."
                            ]},
                            {"paragraph":[
                                "Sin embargo, comprender patrones de diseño requiere un enfoque diferente. Implica identificar patrones en lo que has aprendido concretamente y luego relacionarlos con ideas abstractas."
                            ]},
                            {"paragraph":[
                                "Por lo tanto, mi opinión es que es el trabajo de un profesor mostrar cómo las ideas abstractas surgen de las cosas concretas, proporcionando estructura a los estudiantes para que puedan hacer estas conexiones por sí mismos.",
                                "Por supuesto, hay otra forma de verlo:",
                                "Cuando era niño, mi profesor de arte decía que podía aprender cualquier cosa si la dividía en formas simples y concretas. Comienza dibujando círculos, líneas rectas y curvas, y pronto podrás dibujar un gato.",
                                "Piensa en los niños que empiezan dibujando figuras de palo. Están aprendiendo algo concreto. A medida que se vuelven más hábiles, sus dibujos se vuelven más abstractos y complejos."
                            ]},
                            {"title": "Reflexiones finales."},
                            {"paragraph":[
                                "Podría continuar hablando de esto. Pero en pocas palabras, la enseñanza efectiva es un arte y una ciencia. Requiere tanto un enfoque estructurado como la flexibilidad para adaptarse a las necesidades de los estudiantes."
                            ]},
                            {"paragraph":[
                                "El aprendizaje es un viaje, y la enseñanza es la guía en ese viaje. Con la práctica efectiva, el espacio seguro, la retroalimentación sólida y el equilibrio entre lo abstracto y lo concreto, podemos hacer que este viaje sea tanto productivo como gratificante."
                            ]},
                            {"paragraph":[
                                "Finalmente, quiero cerrar con una cita inspiradora:"
                            ]},
                            {"quote":
                                "Enseñar es aprender dos veces. — Joseph Joubert"
                            }
                        ]
                    },
                    {
                        "title": "Realmente no existes",
                        "description": "La identidad es solo una abstracción útil; no la realidad.",
                        "image": "images/vlog_thumbnails/sisyphus.jpeg",
                        "contents": [
                            {"title": "¿Quién eres?"},
                            {"paragraph": [
                                "No, no te estoy preguntando tu nombre, ni tu ocupación ni tus pasatiempos del domingo por la tarde. ¿Quién eres?",
                                "Cuando era niño, recuerdo un momento en el que mi madre me hizo esta pregunta. Finalmente me llevó al pánico; para cada respuesta que daba, había un '¿pero es eso realmente lo que eres?'. ¿Quién soy?",
                                "Y, sin embargo, cuando preguntas quién es otra persona, es una pregunta bastante natural, con respuestas bastante simples."
                            ]},
                            {"title": "Percepción y Abstracciones."},
                            {"paragraph": [
                                "El mundo es extremadamente complejo. Hay demasiada información para que nuestro cerebro la procese toda, por lo que debemos seleccionar. Nuestra percepción está directamente ligada a nuestra cognición de una manera tan entrelazada que verás principalmente lo que ya esperas (ver el experimento del 'Gorila Invisible').",
                                "¿Cómo darle sentido a este caos?"
                            ]},
                            {"paragraph": [
                                "Abstracciones. Modelos y abstracciones."
                            ]},
                            {"paragraph": [
                                "Cuando observamos el mundo, diferentes personas ven diferentes cosas. Si existe tal cosa como un mundo nouménico único, existe un mundo fenoménico único para cada uno de nosotros (el optimista diría que el mundo es tuyo... jeje).",
                                "Estos mundos percibidos (fenoménicos) difieren según nuestras formas de pensar, y a veces según las diferencias en nuestros sentidos (¡tus ojos no son necesariamente iguales a los míos!).",
                                "La percepción que tenemos es única para nosotros mismos. Y nuestras interpretaciones de lo que vemos también lo son.",
                                "Nuestra comprensión del mundo es una mezcla: conocimiento y estímulos. Percibes, sientes y le das sentido a la información con lo que 'sabes' del mundo. Tu razonamiento está enmarcado por las limitaciones de todos tus razonamientos anteriores, de todo lo que has visto. Cada melodía, cada pintura, cada sonrisa y cada error; todos ellos cambian tu forma de pensar.",
                                "Sin embargo, tu conocimiento es finito: no sabemos nada con una granularidad infinita, sino solo hasta cierto nivel de detalle. Rara es la persona que es simultáneamente consciente de los mecanismos físicos más pequeños en sus uñas y de los juegos de la mente que gobiernan la diplomacia.",
                                "Para entender, debemos limitar el detalle. Debemos abstraer."
                            ]},
                            {"paragraph": [
                                "Abstracciones. Modelos y abstracciones.",
                                "El ámbito de las abstracciones es demasiado amplio, y no es necesario explorar todo para mostrar que no existes.",
                                "Aunque abstraemos de muchas maneras (y de manera bastante fascinante), centrémonos en las abstracciones que haces todos los días durante tus desplazamientos: las personas.",
                                "Cuando percibimos a Alguien Más, debemos darle sentido a lo que percibimos: la apariencia de su rostro, sus ojos, el sonido de su voz o el calor de sus manos. Agrupamos toda esta información en una sola aglomeración: una persona.",
                                "Podemos acumular detalles que asociamos con esa persona: lo que la hace reír, su forma de caminar, cómo mira al cielo estrellado o grita en el tráfico. Si te parece un amigo o un enemigo (que en sí mismos son abstracciones). A medida que aumentamos el detalle, sentimos que la conocemos mejor.",
                                "Cuando te preguntan quién es, responderás con un subconjunto de estos detalles. Es útil. Si tuvieras que absorber cada bit (juego de palabras) de información sobre alguien antes de poder hablar de él, las interacciones sociales serían increíblemente costosas en tiempo, memoria y uso de tu cerebro.",
                                "Sin embargo, las abstracciones son útiles precisamente por la misma razón que son peligrosas. Carecen de detalle. Carecen de matices.",
                                "Las abstracciones son peligrosas cuando se habla de conflicto (piensa en la idea del enemigo), son peligrosas cuando se habla de amor, son peligrosas cuando se escucha: si escuchamos para encontrar la verdad, en lugar de la abstracción, seríamos engañados por una sensación de confianza infundada pero muy fuerte.",
                                "Esta falta de granularidad significa que nunca sabrás realmente quién es otra persona. No completamente. Como mucho, puedes conocerlos mejor que nadie, pero si somos sinceros, debemos reconocer que nunca sabremos quién es alguien realmente."
                            ]},
                            {"title": "El espejo, y por qué no puedes conocerte a ti mismo."},
                            {
                                "image": "images/vlog_images/mirror.png",
                                "caption": "Hombre mirando en el espejo",
                                "link": "https://www.mutualart.com/Artwork/Man-With-a-Mirror/0833A9BCDCD04E35"
                            },
                            {"paragraph": [
                                "Cuando te miras en el espejo, ¿qué ves? Es al responder 'A mí mismo' que nos condenamos inmediatamente, involuntariamente, a la abstracción. La imagen reflejada es simplemente una representación superficial, un instante de la apariencia física que apenas roza la superficie de nuestra verdadera esencia.",
                                "Pero más allá del reflejo físico hay un laberinto de complejidades, contradicciones y pensamientos y emociones en constante cambio. Tratar de definirnos a nosotros mismos es como intentar atrapar sombras; cuanto más buscamos asir nuestra identidad, más parece escaparse.",
                                "Podría decirse que la introspección ofrece un camino hacia el autodescubrimiento, un viaje interior para descubrir las verdades ocultas en nuestra psique. Pero incluso la introspección tiene sus límites, ya que nuestras percepciones de nosotros mismos están teñidas de prejuicios, inseguridades e influencias externas.",
                                "¿Y qué hay del papel de la memoria en la formación de nuestro sentido del yo? Los recuerdos no son registros inmutables del pasado, sino narrativas maleables que evolucionan con el tiempo, moldeadas por recordatorios selectivos y reinterpretaciones. Nuestros recuerdos de eventos pasados están filtrados a través del prisma de la conciencia presente, teñidos de emociones y percepciones que pueden distorsionar o embellecer la verdad.",
                                "Al final, la búsqueda de conocerse a uno mismo puede ser un ejercicio de futilidad, una lucha sisifiana contra la marea de la impermanencia y la incertidumbre. Quizás, en lugar de intentar definirnos, deberíamos abrazar el enigma de nuestra existencia, aceptando la fluidez y la ambigüedad de la identidad.",
                                "Porque en ausencia de un yo fijo, existe un potencial infinito de exploración y descubrimiento, un viaje de autodescubrimiento que trasciende las limitaciones de la definición y la limitación."
                            ]},
                            {"title": "Fisicalidad, unidad: te fundes con el universo."},
                            {
                                "image": "images/vlog_images/cosmos.png",
                                "caption": "Hombre mirando en el espejo",
                                "link": "https://www.ashvinharrison.com/product/abstract-universe-moon-illusion/"
                            },
                            {"paragraph": [
                                "Hemos mostrado que la idea del yo (fenoménico) es agua, un río, un flujo. Una corriente que no puede ser encapsulada por la identidad, sino que fluye, se dobla y muta químicamente a través de la vida.",
                                "Sin embargo, la renuncia al yo también debe reconocerse en el ámbito material (nouménico).",
                                "Parece más fácil responder la pregunta de dónde está tu cuerpo, dónde estás físicamente y cuáles son tus dimensiones. De hecho, tenemos formas apropiadas de medir estas cosas (aunque invito al lector a reflexionar sobre qué es siquiera una medida). Sin embargo, ¿con qué detalle?",
                                "El cuerpo no es una entidad estática, sino un ecosistema dinámico lleno de vida. Considera los trillones de microorganismos que habitan tu cuerpo, desde las bacterias en tu intestino hasta los hongos en tu piel. No somos seres solitarios, sino -principalmente- organismos simbióticos, íntimamente conectados con la red de vida que nos rodea.",
                                "Y, sin embargo, incluso dentro de los límites de nuestra propia carne, las fronteras del yo se vuelven borrosas y se disuelven. La distinción entre el yo y el otro se vuelve cada vez más nebulosa a medida que profundizamos en las complejidades de la biología humana. ¿Qué es tú y qué es ajeno? ¿Eres tu sistema inmunológico? ¿Las bacterias en tu piel? ¿Tu microbiota? ¿Tu sangre? ¿El agua que contiene?",
                                "Las viejas células son reemplazadas continuamente por nuevas en un proceso de regeneración y renovación. En cada momento que pasa, perdemos fragmentos de nosotros mismos en el mundo, dejando rastros de nuestra existencia en el aire que respiramos, la comida que comemos y la tierra bajo nuestros pies. ¿No somos más que un barco de Teseo eterno, cuyas tablas son de agua y regresan al océano?",
                                "Aún más atómicamente, nuestros cuerpos no están separados del cosmos, sino materialmente unidos a él. Somos polvo de estrellas. Estamos hechos del universo y mantenidos juntos por él en cada respiración, cada paso, cada risa y cada lágrima.",
                                "Cuando miras tus dedos y piensas «es aquí donde terminan mis dedos», considera que incluso allí hay átomos de ti más allá, y átomos no-tuyos dentro. Los límites del cuerpo son como la idea misma del cuerpo, borrosos, prácticos, pero puramente conceptuales.",
                                "Cuando levantamos la vista hacia el cielo nocturno, no somos simplemente observadores, sino participantes en una danza de eternidad, en espacio y tiempo. Nos vemos a nosotros mismos, pasado y futuro.",
                                "Entonces, cuando nos hacemos la pregunta, '¿Quién eres?' No busquemos respuestas en los confines de la identidad o los límites del cuerpo. En su lugar, abracemos la inmensidad sin fronteras del ser, reconociendo que no estamos separados del universo, sino partes integrales de su historia en constante evolución.",
                                "Cuando nos pregunten «¿Quién eres?» Respondamos de manera útil, socialmente, con la información que el interlocutor necesita, pero reconozcamos que la verdadera respuesta se desvanecerá para siempre entre nuestros dedos.",
                                "La verdadera respuesta es simple. La verdadera respuesta es liberadora, emancipadora. La verdadera respuesta es armoniosa."
                            ]},
                            {"paragraph": [
                                "No existes."
                            ]}
                        ]
                    },
                    {
                        "title": "Sobre los Límites de la Comunicación: Solo Tú Sabes lo Que Sabes",
                        "description": "Solo tú sabes lo que sabes",
                        "image": "images/vlog_thumbnails/communication.png",
                        "contents": [
                            {"title": "Introducción"},
                            {"paragraph": [
                                "Habla. Codifica. Lee. Escribe.",
                                "Dibuja. Canta. Muévete. Escucha."
                            ]},
                            {
                                "image": "images/vlog_images/birds_singing.png",
                                "caption": "Hombre mirando al espejo",
                                "link": "https://pixabay.com/photos/singing-birds-sing-nature-song-3948645/"
                            },
                            {"paragraph": [
                                "La alegría de ser escuchado, la conexión en el contacto visual. La comunicación es la base de cualquier especie social. Pero en su núcleo, es solo transmitir información.",
                                "Sin comunicación no hay entendimiento. No hay conexión. El progreso es lento o inexistente. Cuando era niño, recuerdo un momento en el que mi madre me hizo esa pregunta. Finalmente me llevó a entrar en pánico; para cada respuesta que daba, había un “pero ¿es eso lo que eres?”. ¿Quién soy?",
                                "Y sin embargo, cuando me preguntas quién es otra persona, esa es una pregunta de lo más natural, con respuestas bastante simples."
                            ]},
                            {"paragraph": [
                                "Debemos comunicarnos; sin embargo, a menudo nos encontramos luchando con las limitaciones naturales para hacerlo. ¿Por qué?"
                            ]},
                            {"title": "Lo que la gente enseña nunca será lo mismo que lo que la gente quiere aprender."},
                            {"paragraph": [
                                "Todos hemos estado allí. Estás sentado en un aula, preguntándote sobre algún detalle de lo que el profesor ha explicado. Haces una pregunta, y parece que están respondiendo a una completamente diferente, tal vez tengas la suerte de aprender algo nuevo, pero tu confusión permanece.",
                                "En ocasiones, también hemos estado en el lado opuesto. Un principiante te hace una pregunta sobre un tema que ya has explicado varias veces, respondes, y asienten ceremoniosamente, pero ambos saben que, sea cual sea el motivo de su pregunta, impregna tus enseñanzas.",
                                "A pesar de los mejores esfuerzos del profesor, la brecha entre lo que se enseña y lo que se entiende persiste.",
                                "Frustrante, pero ¿por qué ocurre eso? ¿Por qué sigue ocurriendo en diferentes culturas y vocaciones?"
                            ]},
                            {"title": "Contexto"},
                            {"paragraph": [
                                "Contexto. Los símbolos no significan nada sin contexto. Todo lo que sabemos, lo sabemos dentro de un conjunto de restricciones, suposiciones e información adyacente.",
                                "Este conjunto suele ser subtextual: no se señala explícitamente en ninguna parte en particular, ni siquiera somos necesariamente conscientes de su existencia. Sin embargo, no hay ningún pensamiento en tu mente que tenga sentido sin contexto; sin las definiciones de las palabras que usas para enunciarlo, las suposiciones implícitas que haces o las cosas que asumes que todos deben saber.",
                                "La naturaleza discreta de esta información contextual es especialmente problemática para los expertos. Cuando un experto se comunica, a menudo presume que lo que está diciendo es obvio o de sentido común. Para ellos lo es, porque su conocimiento contextual es rico en ese campo, y muchas de sus observaciones son simples consecuencias de lo que saben.",
                                "Fallamos -con demasiada frecuencia- en reconocer que este contexto es precisamente nuestra experiencia, y presumir que esta información es ampliamente compartida efectivamente bloquea nuestra capacidad de entendernos, de trabajar juntos, de escucharnos y de conectarnos sinceramente.",
                                "El contexto se interpone en muchas otras tareas basadas en la comunicación: la resolución de conflictos es más difícil cuando no entiendes de dónde viene la otra parte, la cultura es más difícil de apreciar con una vista superficial (sin contexto), la colaboración se ve obstaculizada por malentendidos fundamentales sobre el trabajo que debe realizarse o sus costos.",
                                "Por otro lado, proporcionar demasiado contexto en la comunicación es a menudo inútil: lleva tiempo compartir, lleva tiempo consumir, y la mayoría de las veces ni siquiera incluye la información que la otra persona realmente quiere. Incluso cuando intentamos comunicarnos mejor, estamos permanentemente impedidos de alcanzar la perfección.",
                                "El contexto nos hace conocedores, pero parece impedir tantas cosas en la comunicación entre nosotros. Debemos preguntarnos: ¿es el contexto? ¿O somos nosotros?",
                                "Yo sostengo que no eres tú (el contexto), soy yo."
                            ]},
                            {"title": "Solo yo sé lo que sé:"},
                            {"paragraph": [
                                "La gente es complicada. Sabemos muchas, muchas cosas.",
                                "Sin embargo, no almacenamos nuestro conocimiento en una memoria compartida. No hay una mente colmena factual.",
                                "Tú sabes lo que sabes, y yo sé lo que sé.",
                                "Pero si te pregunto “¿Qué sabes?”, esperando una lista de toda la información en tu cerebro, te parecería lo más ridículo. Incluso suponiendo que pudieras hacer tal lista, no lograrías comunicarla correctamente (véase el título del artículo). Pero no puedes hacer tal lista.",
                                "¿Por qué?",
                                "“¿Qué sabes?” cae, creo, en la misma rama de investigación que preguntas como “¿Quién eres?” (que he explorado en otro artículo: “Realmente No Existes”)",
                                "Para la mayoría de nosotros, una limitación suficiente para responder completamente a estas preguntas es la vaguedad de lo que significa la pregunta. ¿Qué es “saber” realmente? ¿Qué es “yo”?",
                                "¿Sé algo si sé dónde encontrarlo? ¿Sé algo si me lo ha enseñado otra persona? ¿Cómo podemos estar seguros de que esta otra persona lo sabía correctamente? ¿Qué significa para ellos saber?",
                                "La cuestión de lo que sabemos es por naturaleza recursiva ad nauseam. Siempre hay el siguiente paso de “Pero ¿cómo sabemos eso?” hasta que llegamos a suposiciones axiomáticas. Los axiomas no son conocibles, simplemente se suponen. Entonces, podemos suponer, y luego podemos inferir a partir de suposiciones."
                            ]},
                            {"title": "Nunca podemos saber"},
                            {"paragraph": [
                                "Entonces... no podemos saber cosas. Voilà merci, gracias por tu lectura, aventurémonos en las calles con un temor cínico de nuestra condena a la ignorancia eterna.",
                                "Esta es una interpretación poco pragmática.",
                                "Creo que hay una interpretación alternativa que no solo encuentro infinitamente más útil, y más interesante, sino también sinceramente bastante liberadora."
                            ]},
                            {
                                "image": "images/vlog_images/hummingbird.png",
                                "caption": "Hombre mirando al espejo",
                                "link": "https://www.audubon.org/news/hummingbirds-shake-their-tail-feathers-generate-high-pitched-sounds"
                            },
                            {"paragraph": [
                                "Enseñar, y de hecho cualquier comunicación, nunca ha sido sobre cosas conocibles. Ha sido -y considero que siempre será- sobre persuadir y convencer a los demás de explotar información útil, métodos útiles, herramientas útiles y prácticas útiles para vivir mejor. Para hacer mejores preguntas, para resolver problemas más importantes.",
                                "Pensar en la comunicación como la transferencia de la verdad es una arrogancia muy humana. No podemos conocer la verdad, no de ninguna manera real. Pero podemos conocer la verdad de muchas maneras útiles.",
                                "Los niños son excelentemente transparentes con esto. Para cualquier verdad que consideres innegable, ellos la desafiarán sin malicia pero con simple curiosidad: porque nada de lo que sabes es verdaderamente innegable."
                            ]},
                            {"paragraph": [
                                "Pero ¿qué nos dice todo esto sobre la comunicación entre nosotros?",
                                "Si no hay conocimiento fundamental real, sino solo fragmentos útiles, ¿qué estamos haciendo realmente?"
                            ]},
                            {"title": "Conclusión: hacemos lo mejor que podemos. Pero no lo mejor."},
                            {"paragraph": [
                                "No sabemos nada, y sin embargo, seguimos... hablando. Hablamos, escribimos, cantamos y lo intentamos.",
                                "Comunicamos nuestros saberes, nuestras advertencias, nuestros relatos, nuestras historias y consejos.",
                                "Comunicamos para ayudarnos mutuamente; para ayudarnos a nosotros mismos.",
                                "Hacemos lo mejor que podemos."
                            ]},
                            {"paragraph": [
                                "Sin embargo, seamos permanentemente conscientes: nunca comunicaremos de la mejor manera.",
                                "No podemos, así que seamos humildes. Conversemos, sigamos intentándolo.",
                                "Ser imperfectos nos da poder en la iteración, en volver a intentar, en los idas y vueltas."
                            ]},
                            {"paragraph": [
                                "Sigamos ayudándonos mutuamente, pero la próxima vez que un estudiante levante la mano, recuerda: no pueden hacer la pregunta perfecta, y no puedes decirles exactamente lo que quieren.",
                                "Pero es mejor si lo intentas."
                            ]},
                            {
                                "image": "images/vlog_images/helping_hand.png",
                                "caption": "Hombre mirando al espejo",
                                "link": "https://www.pinterest.com/pin/634937247461784490/"
                            }
                        ]
                    },
                    {
                        "title": "Aspira a hacer, no a ser.",
                        "description": "Reflexiones sobre el estado mental que me ha dado paz y lo que considero un crecimiento saludable y sostenible.",
                        "image": "images/vlog_thumbnails/compass.jpeg",
                        "contents": [
                            {"title": "Aspira a hacer, no a ser."},
                            {
                                "image": "images/vlog_images/self.webp",
                                "caption": "Ilustración por Zoe Liu en Cómo nuestro cerebro preserva nuestro sentido del yo - Scientific American",
                                "link":"https://www.scientificamerican.com/article/how-our-brain-preserves-our-sense-of-self/"
                            },
                            {"paragraph":[
                                "¿Qué quieres ser cuando crezcas?",
                                "¿Quién eres?"
                            ]},
                            {"paragraph":[
                                "¿Por qué nos molestamos en responder a estas preguntas?",
                                "¿Qué es lo que realmente estamos tratando de entender con ellas?",
                                "Mi tesis es que buscamos una descripción abreviada de las personas: «Oh, este tipo es A, este tipo es B».",
                                "Hace que sea más fácil hablar de nosotros mismos y de los demás, reduciendo nuestras identidades a simples etiquetas."
                            ]},
                            {"paragraph":[
                                "Pero aquí está el problema: preguntar quién queremos ser es un error, un malentendido.",
                                "Es como confundir la foto con la persona.",
                                "La identidad es una instantánea momentánea, algo fluido y en constante cambio.",
                                "En lugar de obsesionarnos con capturar la foto perfecta -como nos hemos acostumbrado a hacer- yo argumentaría que el marco más poderoso es bailar lo mejor que podamos."
                            ]},
                            {"title": "Construir."},
                            {
                                "image": "images/vlog_images/beaver.jpg",
                                "caption": "Castor descansando en su presa",
                                "link":"https://www.brainson.org/episode/2023/09/19/how-do-animals-build-their-homes"
                            },
                            {"paragraph":[
                                "Prioriza. Haz música en lugar de ser músico. Haz deporte en lugar de ser atleta. Construye cosas en lugar de ser ingeniero. Descubre y maravíllate en lugar de ser científico. Concéntrate en el acto, la experiencia, la alegría de hacer."
                            ]},
                            {"paragraph":[
                                "Por ejemplo, considera la diferencia entre «ser músico» y «hacer música».",
                                "El primero es un título, una abstracción de expectativas.",
                                "El segundo es una libertad, una experiencia, una buena idea, una tarde relajada.",
                                "Cuando priorizas hacer música, te permites explorar, fallar, crecer, sin la presión de estar a la altura del título de «músico»."
                            ]},
                            {"paragraph":[
                                "Si la perfección es la enemiga de lo bueno, entonces la expectativa es la enemiga de la acción. Y la acción es el camino hacia el crecimiento. En la acción y el crecimiento construyes el yo constante que quieres ser. Construye cosas, construye tu vida y constrúyete a ti mismo: no hay proyecto más importante que tú, porque sin ti no hay nada más que hacer."
                            ]},
                            {"paragraph":[
                                "Entonces, ama y juega. Haz cosas. Aspira a hacer, no a ser. Al hacerlo, puede que encuentres que las etiquetas, si es que importan, seguirán naturalmente, moldeadas por la riqueza de tus experiencias."
                            ]}
                        ]
                    },                    
                    {
                        "title": "Sobre los comportamientos emergentes",
                        "description": "Reflexionando sobre algunas de las formas en que las reglas simples generan nuestro mundo caótico.",
                        "image": "images/vlog_thumbnails/emergent_behavior.webp",
                        "contents": [
                            {"paragraph":[
                                "Regla 1: No hablar sobre el club de la pelea.", 
                                "Regla 2: No se permiten armas.", 
                                "Regla 3: No hablar sobre el club de la pelea.",
                                "La anarquía se desata."
                            ]},
                            {"title": "Sobre los comportamientos emergentes."},
                            {
                                "image": "images/vlog_images/emergence.jpg",
                                "caption": "Bolas de queso, Napanoch, Nueva York, 2012 - Parte de la colección de Comportamiento Emergente de Thomas Jackson",
                                "link":"https://www.thomasjacksonphotography.com/emergent-behavior.html"
                            },
                            {"paragraph":[
                                "Un átomo se sacude en el espacio. No se sacude solo, sino con amigos. Están más agitados de lo habitual y te quemas con fiebre. Están menos agitados y te congelas. Algunos se agitan aquí, otros allá."
                            ]},
                            {"paragraph":[
                                "Algunos se agitan justo en el espacio donde ocurren las sinapsis, formando tu líquido cefalorraquídeo: estos átomos que se agitan te mantienen vivo. Otros se agitan un poco al lado, dispuestos de una manera muy conveniente, formando grupos de átomos (también conocidos como bandas de chicos que se agitan) que llamamos moléculas.",
                                "El nombre proviene del número de átomos en una molécula, pero no ocuparé el tiempo de un mol para explicarlo."
                            ]},
                            {"paragraph":[
                                "Estas moléculas pasan el rato. Están relajadas, incluso vibrando. Como palabras en una oración, simplemente se organizan en una célula.",
                                "Las células mismas están organizadas de una manera bastante inteligente, y lo llamamos Neurona. Si se rompen de una manera específicamente maligna, lo llamamos Cáncer."
                            ]},
                            {"paragraph":[
                                "A este grupo que se agita lo llamamos temperatura. Solo con esto, ya comenzamos a ver emerger una complejidad significativa: puedes tener neuronas frías o neuronas calientes, cáncer frío o cáncer caliente. Puedes tener células hechas de estas moléculas o de aquellas otras moléculas. Puedes tener algo aquí o algo allá."
                            ]},
                            {"paragraph":[
                                "Ya, con solo algunas cosas simples en mente, hay tanto por descubrir."
                            ]},
                            {"paragraph":[
                                "Cosas tan pequeñas, con reglas tan simples en su esencia."
                            ]},
                            {"paragraph":[
                                "Sin embargo, cuando apilamos capas sobre capas de simplicidad, obtenemos vida. Obtenemos todo. Puede parecer sorprendente, pero las matemáticas lo hacen bastante obvio.",
                                "Si tienes n capas, con Xn reglas cada una, entonces ingenuamente tienes un total de X1 * X2 * ... * Xn reglas en total.",
                                "¡Eso son muchas reglas que pueden definir tantas combinaciones diferentes!"
                            ]},
                            {"paragraph":[
                                "¿Qué es la vida? Mi sospecha es que la palabra en sí misma es simplemente un clasificador. Nuestro cerebro simplificando el mundo para nuestro gran beneficio al vivir, pero para nuestra gran desventaja al entender."
                            ]},
                            {"paragraph":[
                                "Creo que la vida no es una sola cosa. Creo que la vida es esta permutación de reglas extremadamente variadas y ricas.",
                                "La vida es la combinación de todas estas pequeñas cosas que suceden, y que a veces se permutan en cosas más grandes que nuestro cerebro percibe y clasifica. La vida es cuando decimos “oh, eso está vivo”."
                            ]},
                            {"paragraph":[
                                "También existen definiciones científicas de lo que es la vida, pero la ciencia en sí es cuando decimos “oh, eso es ciencia”.",
                                "Por supuesto, es menos subjetivo que tu gusto musical, pero no es mucho más objetivo que una combinación de todas nuestras subjetividades. Opiniones e ideas mezcladas con mediciones, que en última instancia solo podemos consumir a través de nuestros sentidos.",
                                "Monos tratando de hacer lo mejor para desasociarse de sus órganos sensoriales para ver alguna verdad superior. Es toda una lucha: incluso en la frase anterior volvemos a los sentidos, intentamos ver."
                            ]},
                            {"paragraph":[
                                "¿Qué es la inteligencia? Creo que la respuesta es bastante similar: la inteligencia es que veo algo y pienso que piensa. Mono ve, mono clasifica.",
                                "Pero vayamos más allá de la palabra, ¿qué es esta idea de inteligencia? (Qué idealismo platónico en el que nos deleitamos)"
                            ]},
                            {"paragraph":[
                                "Creo que la inteligencia también es solo una combinación de reglas. En nosotros, son las reglas hasta la capa de abstracción del cerebro, o a veces de la combinación de cerebros en muchos cerebros: personas u otros."
                            ]},
                            {"paragraph":[
                                "Bueno, entonces, ¿cómo es que alguna vez creímos que solo nosotros podemos ser inteligentes? ¿No es eso una gran arrogancia -infundada-? ¿Una terrible hybris humana?",
                                "¿Y por qué alguna vez pensaríamos que no podemos crear inteligencia? Es solo combinatoria, no es ciencia espacial.",
                                "Hoy estamos intentando combinando reglas de computación y estadísticas, porque hemos sentido que funciona mejor que otras cosas que hemos probado (sí, la ciencia parece ser principalmente joder y descubrir) pero esas son solo algunos conjuntos arbitrarios de reglas que usamos. Si hay un límite para esas, podemos usar otras."
                            ]},
                            {"paragraph":[
                                "Venimos de tipos que se agitan, ¿es tan difícil imaginar que otras cosas puedan venir de nosotros?"
                            ]},
                            {"paragraph":[
                                "Es todo simplemente... comportamientos emergentes."
                            ]}
                        ]
                    },
                    {
                        "title": "Sé Bueno y Grande",
                        "description": "Un recordatorio para aspirar al crecimiento, pero sin torcerse.",
                        "image": "images/vlog_thumbnails/good_and_great.jpeg",
                        "contents": [
                            {"paragraph":[
                                "En uno de los cuentos de Kafka, nos habla de muchos hijos, muchos hijos arquetípicos de muchos hombres.",
                                "Cada uno notable a su manera, uno tremendamente encantador, otro muy inteligente, otro hermoso hasta ofender a los olímpicos.",
                                "Sin embargo, ninguno de ellos tiene el encanto sincero que encuentro en el 'no notable'.",
                                "No notable, ingenuo, no muy brillante, y aún así es amable.",
                                "Él es quien lleva la mejor vida."
                            ]},
                            {"title": "Sé Bueno y Grande."},
                            {
                                "image": "images/vlog_images/trees.jpg",
                                "caption": "Árbol de Sangre de Dragón, El Árbol Milenario de la Isla Socotra",
                                "link":"https://mybestplace.com/en/article/dragons-blood-tree-the-millennial-tree-of-socotra-island"
                            },
                            {"paragraph":[
                                "Quiero más."
                            ]},
                            {"paragraph":[
                                "¿Acaso no todos queremos más?"
                            ]},
                            {"paragraph":[
                                "Siempre hay más.",
                                "El deseo es un barril con agujeros, que llenamos y llenamos y llenamos, solo para ver cómo gotea y gotea y gotea.",
                                "El crecimiento es paradójicamente tanto deseable como venenoso. Es un impulso, un combustible que nos empuja hacia adelante, un cambio, una mejora.",
                                "Sin embargo, como muchos árboles, es demasiado fácil crecer torcido."
                            ]},
                            {"paragraph":[
                                "Para crecer, primero debemos estar muy seguros de la dirección en la que estamos creciendo. Sin una dirección clara, corremos el riesgo de no crecer en absoluto, sino simplemente de vagar sin rumbo."
                            ]},
                            {"paragraph":[
                                "Por otro lado, la tentación de no crecer, de no cambiar, puede ser igual de peligrosa.",
                                "La estática tiene cierto encanto, pero es un confort empapado de toxicidad.",
                                "Todos debemos estar continuamente en movimiento, al menos para igualar las mareas de la tierra y la vida a nuestro alrededor.",
                                "Cuando la vida deja de moverse, lo llamamos un cadáver. Vivir es moverse. Y moverse es cambiar.",
                                "Si vamos a cambiar, entonces hagámoslo con propósito: crezcamos."
                            ]},
                            {"paragraph":[
                                "Sin embargo, a menudo caemos en la trampa de asumir que somos buenos simplemente porque no hacemos daño. Esta percepción es errónea: ser inofensivo no es lo mismo que elegir no hacer daño."
                            ]},
                            {"paragraph":[
                                "¿Es bueno hacer lo que la gente te dice que hagas? ¿Seguir lo que otros declaran como bueno?",
                                "La historia nos ha demostrado muchas veces que esto no es cierto, y las lecciones están grabadas en sangre.",
                                "¿Es uno verdaderamente bueno si carece de la fuerza para ir contra las expectativas sociales? ¿O eso es solo conformismo?"
                            ]},
                            {"paragraph":[
                                "La única manera real de crecer es hacer ambas cosas: adquirir fuerza y dirigirla adecuadamente.",
                                "El verdadero crecimiento requiere cultivar uno mismo en tres dimensiones: competencia, el poder de hacer cosas (distinto de lo que a menudo llamamos poder, que yo denominaría corrupción), y el espíritu: el corazón y el alma."
                            ]},
                            {"paragraph":[
                                "Solo desarrollándonos en estas áreas podemos encontrar la dirección correcta y crecer firmemente en ella.",
                                "Solo entonces podemos ser verdaderamente buenos y usar nuestra grandeza para impulsarnos hacia adelante en el camino correcto."
                            ]},
                            {"paragraph":[
                                "Para asegurar que tu crecimiento sea con propósito, evalúa regularmente tu dirección. Pregúntate:"
                            ]},
                            {"list":[
                                "¿Estoy creciendo en la dirección correcta?",
                                "¿Estoy cultivando las fortalezas adecuadas?",
                                "¿Estoy desafiando las expectativas sociales cuando entran en conflicto con mis principios?"
                            ]},
                            {"paragraph":[
                                "Reflexiona sobre estas preguntas y ajusta tu rumbo según sea necesario. El verdadero crecimiento es intencional y guiado por un sentido bien desarrollado de dirección e integridad."
                            ]},
                            {"paragraph":[
                                "No te daré detalles específicos. Ya sabes lo que debes hacer.",
                                "Hazlo mejor. Sé grande."
                            ]}
                        ]
                    }
                ]
        }
    },
    "fr": {
        "languages":["anglais", "espagnol","français"],
        "personal": {
            "journey": {
                "title": "Salut! 👋",
                "description": [
                    "J'suis /h Santiago, incontestablement mexicain, et je travail en tant qu'un /h Ingénieur /h de /h Logiciel.",
                    "J'aime lire, programmer, faire musique, créer, enseigner, aprendre, écrire et faire du vélo. Et les parcs. Et les musées. J'ai un véritable appétit pour la vie.",
                    "Je pense que nos actions nos representent, ainsi donc je vous invite à explorer ce site et découvrir ce que je fais, ce que j'ai fait, ce que j'écris et ce que je pense.",
                    "Si vous n'avez pas temps pour cela: mes amis -ayant 1 seule mot- me decriraient comme inhabituel, ayant 2 ils pourraient ajouter contradictoire, et ayant 3 j'espere qu'ils pourraient admettre que je suis remarcablement drôle.",
                    "On dit souvent que nous sommes ce que nous mangions, donc voici un peu de ma diète:"
                ]
            },
            "books": [
                "images/books/anElegantDefense.jpg",
                "images/books/immune.jpeg",
                "images/books/whenTheBodySaysNo.jpeg",
                "images/books/gunsGermsAndSteel.jpg",
                "images/books/theJakartaMethod.jpg",
                "images/books/crimeAndPunishment.jpg",
                "images/books/manSearchForMeaning.jpg",
                "images/books/madameBovary.jpg",
                "images/books/aHundreadYearsOfSolitude.jpg",
                "images/books/theFeastOfTheGoat.jpg",
                "images/books/capital.jpeg",
                "images/books/theTyrannyOfMerit.jpg",
                "images/books/braidingSweetgrass.jpeg",
                "images/books/thinkingFastAndSlow.jpg",
                "images/books/1984.jpg",
                "images/books/braveNewWorld.jpg",
                "images/books/fahrenheit451.jpg",
                "images/books/hitchikersGuide.jpeg",
                "images/books/understandingPower.jpeg",
                "images/books/anna_karenina.jpeg",
                "images/books/brothers_karamazov.jpeg",
                "images/books/how_to_solve_it.jpg",
                "images/books/lotr.jpeg",
                "images/books/metamorphosis.jpeg"
            ],
            "movies": {
                "posters": [
                    "images/movies/wall-e.png",
                    "images/movies/theIronGiant.png",
                    "images/movies/spiderverse.png",
                    "images/movies/pussInBoots.png",
                    "images/movies/coco.png",
                    "images/movies/howlsMovingCastle.png",
                    "images/movies/laVieEstBelle.png",
                    "images/movies/ladyBird.png",
                    "images/movies/moonlight.png",
                    "images/movies/roma.png",
                    "images/movies/pansLabyrinth.png",
                    "images/movies/whiplash.jpeg",
                    "images/movies/blackSwan.png",
                    "images/movies/1917.png",
                    "images/movies/joker.png",
                    "images/movies/parasite.png",
                    "images/movies/requiem.png",
                    "images/movies/theShining.png",
                    "images/movies/trainspotting.png"
                ]
            },
            "albums": {
                "covers": [
                    "images/albums/21-savage_i-am-i-was.png",
                    "images/albums/black-keys_el-camino.jpeg",
                    "images/albums/brockhampton_saturation.png",
                    "images/albums/gorillaz_2001.png",
                    "images/albums/kenny-beats_louie.jpeg",
                    "images/albums/little-simz_no-thank-you.jpeg",
                    "images/albums/mac-miller_faces.jpeg",
                    "images/albums/the-strokes_the-new-abnormal.png"
                ]
            }
        },
        "professional": {
            "work": {
                "title": "Projets que j'ai réalisés.",
                "positions" : [
                    {
                        "place": "Figma, 2023 - Présent",
                        "title": "Ingénieur Logiciel : Infrastructure",
                        "description" : [
                            {"paragraph": "J'ai acquis une réputation pour ma rapidité d'apprentissage et ma capacité à accomplir les tâches. Mon travail inclut:"},
                            {
                                "list": [
                                    "Migration du backend de notre API REST ; cela faisait partie d'un projet de dépréciation de service qui a permis d'économiser 18 millions de dollars par an.",
                                    "Construction d'une infrastructure essentielle pour les fonctionnalités de recherche par IA.", 
                                    "Actuellement, je travaille sur notre technologie multijoueur en Rust/Typescript pour la collaboration en temps réel."
                                ]
                            },
                            {"paragraph": "Je suis orienté vers les résultats, mes outils varient, mais j'ai principalement utilisé : Ruby, Rust, TypeScript, React, Terraform et AWS, ainsi qu'un peu de Kubernetes."}
                        ],
                        "image": "images/experience/figma.png"
                    },
                    {
                        "place": "Université de Montréal, 2021 - 2023",
                        "title": "Assistant d'Enseignement et de Recherche.",
                        "description" : [
                            {"paragraph": "Dès mon arrivée à Montréal jusqu'à mon départ pour NYC, j'ai travaillé comme assistant d'enseignement pendant 2 ans, avec environ 1650 étudiants (sans compter les recoupements) :"},
                            {
                                "list": [
                                    "Programmation 101 avec Python (pour 3 sessions)",
                                    "Concepts et paradigmes des langages de programmation (pour 2 sessions)", 
                                    "Structures discrètes en informatique (2 sessions)",
                                    "Développement et conception web (2 sessions)", 
                                    "Génie logiciel", 
                                    "Concepts avancés de Java"
                                ]
                            },
                            {"paragraph": "Un GRAND merci - à la fois pour avoir supporté cette expérience avec moi, et pour m'avoir encadré tout au long - à : Marc Feeley, Olivier Melançon, Stefan Monnier, Miklós Csűrös, Sébastien Roy, Amal Ben Abdellah et Michel Reid."}

                        ],
                        "image": "images/experience/Paradigms.jpg"
                    },
                    {
                        "place": "Ixiasoft",
                        "title": "Développeur Full Stack - stagiaire, 2022",
                        "description" : [
                            {"paragraph": "Durant l'été 2022 : J'ai implémenté des fonctionnalités expérimentales, documenté et débogué l'application web DITA CCMS d'Ixiasoft pour la documentation technique. J'ai principalement travaillé avec :"},
                            {
                                "list": [
                                    "Java",
                                    "TypeScript", 
                                    "React et Redux", 
                                    "Apache", 
                                    "Maven", 
                                    "CSS"
                                ]
                            }
                        ],
                        "image": "images/experience/fullstack.jpg"
                    }
                ]
            },

            "education": {
                "title":"Places where I've studied.",
                "classHeader":"Some of my favorite classes:",
                "schools" : [
                    {
                        "name": "Université de Montréal",
                        "image": "images/institutions/UdeM.jpeg",
                        "degree": "Bachelors of Science, Computer Science",
                        "details": "Montreal | 2020-2023",
                        "abreviation": "UdeM",
                        "description": 
                        [
                            "I did my honors project on genome assembly scaffolding with paired sequencing reads -which is a fancy way of saying: I arranged DNA snippets to build a genome, its hard because the snippets are messy, faulty, and could go anywhere... so how do you know where to put them? The snippets I studied were from an Agrobacterium, which is a bacteria that makes plants sick =(. I was also a consulting director at 180DC UdeM."
                        ],
                        "classes": [
                            "Data Science",
                            "Operating Systems",
                            "UI/UX",
                            "Data Structures",
                            "Algorithms",
                            "Data Science",
                            "Quantum Informatics",
                            "Databases",
                            "Machine Learning",
                            "3D Computer vision",
                            "Linear Algebra",
                            "Genetics"
                        ]
                    },
                    {
                        "name": "Lycée franco-mexicain",
                        "image": "images/institutions/LFM.jpeg",
                        "degree": "French Baccalaureat, Engineering Science",
                        "details": "Mexico | 2017-2020",
                        "abreviation": "LFM",
                        "description": [
                            "I went on the Science track, specialized in maths and engineering, and finished with a mention très bien: TB -which was the highest honors available at the school-, I was a candidate to the concours general in mathematics, physics and engineering (only the best of each school are allowed to participate). I founded and  led the Machine Learning club, and I was in the Programming Club"
                        ],  
                        "classes": [
                            "Advanced Maths",
                            "Engineering Sciences",
                            "French",
                            "English",
                            "Spanish",
                            "German"
                        ]
                    }
                ]
            },
            "projects": 
            {
                "title":"Academic and Personal Projects",
                "projects": [
                    {
                        "title": "Multithreaded web server",
                        "description": [
                            "Built a Multithreaded web server using Rust! It's the final project in the Rust book, and I figured it'd be the best way to get acquainted with the language."
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/rust.jpg"
                    },
                    {
                        "title": "Orball",
                        "description": [
                            "Learned to make 2D games using Godot and gdscript. Didn't bother to finish it, but I did implement some procedural generation and per-chunk incremental loading (this prevents the typical case where you open a game and its very slow to boot up) that I'm happy with. You can play it, but honestly it aint a fun game!",
                            ""
                        ],
                        "link": "https://gfecito.itch.io/orball?secret=GNoDj8sJ0n9m71KTTVJOJrjcjD8",
                        "websiteLabel":"Play it now (move with WASD; eat by holding down E)",
                        "image": "images/projects/Orball.jpg"
                    },
                    {
                        "title": "Looks",
                        "description": [
                            "Built the prototype for a clothing-oriented social media platform and app using Swift (with SwiftUI and UIKit), Typescript, Firebase. I built the iOS prototype, an admin page, a waitlist/promo site, as well as setting up our DB, compute, permissions and a connection to Amazon via API.",
                            ""
                        ],
                        "link": "https://looks-waitlist.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/looks.png"
                    },
                    {
                        "title": "AI for Climate",
                        "description": [
                            "This project, under Mila - Quebec AI Institute, aims to improve climate modeling for weather forecasting, agriculture, and more. Current models struggle with unreliable small-scale data. As project manager and core contributor, I organized our team to enhance these models with state-of-the-art solutions, made a dedicated website and worked on our data pre-processing for the models.",
                            ""
                        ],
                        "link": "https://climate-model-downscaling.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/MLClimate.png"
                    },
                    {
                        "title": "Genomics",
                        "description": [
                            "This is a research and development project for UdeM's Laboratory of Computational and Theoretical Biology. Researched and implemented an API for genome assembly refinement, as well as a binning scheme data structure, using JAVA and the htsjdk library. The work is thoroughly documented and explained here:",
                            ""
                        ],
                        "link": "https://genome-assembly-scaffolding.web.app/",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Genomics.jpeg"
                    },
                    {
                        "title": "AI 3D Computer-Vision",
                        "description": [
                            "This project for UdeM's Laboratory of 3D Computer Vision involved implementing CNN architectures based on GC-Net for binocular stereoscopy using Mathematica. I focused on depth variations, residual nets, estimation quality, and computational expense. Code and models are available online.",
                            ""
                        ],
                        "link": "https://github.com/Gfecito/GC-Neat",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Disparity.png"
                    },
                    {
                        "title": "ML Models",
                        "description": [
                            "I developed machine learning models for supervised tasks using Python, implementing KNN, Parzen Windows, perceptrons, and SVMs from scratch, and using libraries for neural networks and CNNs. I tested these models on regression and classification problems with datasets including bank records, phone records, and MNIST.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/ML.png"
                    },
                    {
                        "title": "File Management System",
                        "description": [
                            "We implemented a 'File Allocation Table'-based storage management system using C for a 32-bit Linux system. In human talk: we built the file -and memory- management section of an operating system.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/FAT32.jpeg"
                    },
                    {
                        "title": "Database",
                        "description": [
                            "Planned then built a small database for a library. In the planning, we used formal methods for entity-relationship modelling, then relational modelling, relational algebra, request optimization and database normalization. For the implementation, we used SQL, Hibernate (Java) and Maven for compilation and delivery of the executable.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Database.jpeg"
                    },
                    {
                        "title": "Gesture Recognition Web-App",
                        "description": [
                            "Partitioned and preprocessed a database, built and trained a convolutional neural network model, exported and then implemented it into a dynamic web platform. I built the latter using Flask (Python) and Jinja.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/GestureRecognition.gif"
                    },
                    {
                        "title": "Vaccination Management",
                        "description": [
                            "I developed a Java app with an interactive graphical interface and a data management system. The process included engineering planning, interviews, prioritization, use case definitions, risk analysis, non-functional requirements, constraints, VPP modeling, design, prototyping, automatic testing with JUnit, team management, scheduling, and documentation with Javadoc.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Vaccination.png"
                    },
                    {
                        "title": "21st Century Abacus",
                        "description": [
                            "School project for object-oriented programming with Java; it's a small window. Using JavaFX, we (2 people) made a fancy window with 2 counters: you can add and subtract, divide and multiply, undo and redo. Every action performed in the app was temporarily saved, and as such the actions log was always available for exporting as a .txt file.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/CounterThumbnail.png"
                    },
                    {
                        "title": "Interpreters",
                        "description": [
                            "A Pseudo-Lisp interpreter made with Haskell: Built the interpretation and evaluation section of a Haskell program that could read and execute files from a Lisp-inspired language. Dealt with functions, closure, environments, variables, recursion and recursive definitions, etc... the whole enchilada. Then built a Pseudo-Haskell interpreter, where I used Prolog for interpreting and executing, same features as before, but with added type inference.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/Interpreter.png"
                    },
                    {
                        "title": "Environnemental Simulation",
                        "description": [
                            "Using object-oriented programming we made an environmental simulation program. It read XML files describing animals or plants and simulated them for a certain amount of epochs: the way they interacted, what they ate, their energy consumption, whether they died or reproduced, and so on.",
                            ""
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/WildLionSimulator3D.jpeg"
                    },
                    {
                        "title": "This site!",
                        "description": [
                            "Originally made from scratch with HTML, CSS, JavaScript, jQuery as well as the Animate on Scroll library. Currently built with React, TypeScript, JSON, CSS... and a sprinkle of love!"
                        ],
                        "link": "",
                        "websiteLabel":"Visit Website",
                        "image": "images/projects/ThisSite.jpeg"
                    }
                ]
            },
            "awards": {
                "title":"Awards",
                "dateLabel":"Date: ",
                "awards": [
                    {
                        "title":"ICPC NE-NA",
                        "date":"February 2023",
                        "description":[
                            "The 2nd best team in DIRO's history in this prestigious programming competition",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"DIRO's excellence scholarship",
                        "date":"December 2021",
                        "description":[
                            "Excellence scholarship awarded to the top bachelor students in the DIRO (Department of Computer Science and Operations Research)",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"Exemption Scholarship for international students",
                        "date":"August 2020",
                        "description":[
                            "Biggest merit-based scholarship for international students at the Université de Montréal",
                            ""
                        ],
                        "image":"images/trophy.png"
                    },
                    {
                        "title":"French regional math olympiads | Best team, Top 3 individual",
                        "date":"2019",
                        "description":[
                            "My region spanned from Mexico to Panama, and included all french teaching institutions there."
                        ],
                        "image":"images/trophy.png"
                    }
                ]
            }
        },
        "articles": {
            "title":"Ce que je pense. Ce que j'écris.",
            "closeArticleLabel":"Fermer article",
            "scrollLabel":"Aller au fond",
            "articles":
                [
                    {
                        "title": "À propos de l'apprentissage et de l'enseignement",
                        "description": "Réflexions sur la manière d'étudier, d'apprendre et d'enseigner efficacement.",
                        "image": "images/vlog_thumbnails/teacher_in_class.jpeg",
                        "contents": [
                            {"title": "À propos de l'apprentissage et de l'enseignement."},
                            {
                                "image": "images/vlog_images/dead_poets_society.jpg",
                                "caption": "Robin Williams dans le rôle de John Keating dans Le Cercle des Poètes Disparus",
                                "link":"https://www.huffpost.com/entry/the-dead-poets-society-gu_b_749665"
                            },
                            {"paragraph":[
                                "Dans cet article, je partagerai ce que j'ai appris en tant qu'élève et en tant qu'enseignant au fil des ans. L'accent sera mis sur la recherche de méthodes efficaces pour apprendre, ainsi que sur les méthodes efficaces pour enseigner.",
                                "Pour une perspective plus complète, je recommande vivement le livre de G. Polya, 'How to Solve It', qui est un excellent ouvrage sur l'art d'enseigner et d'apprendre à résoudre des problèmes."
                            ]},
                            {"paragraph":["Quand je parle de bons enseignants tout au long de l'article, il y a une reconnaissance implicite qu'il existe de mauvais enseignants. Les mauvais enseignants, je pense, sont des bons enseignants en puissance; car l'enseignement est quelque chose que l'on apprend."]},
                            {"title": "Pratique efficace:"},
                            {"paragraph":["La pratique rend parfait. Eh bien, pas tout à fait, mais la pratique s'améliore. Je pense que la parabole de la classe de poterie l'illustre le plus succinctement :"]},
                            {"quote":
                                "Il était une fois un professeur de poterie nommé Brian. Un mois, il décida de diviser sa classe en deux groupes. Le groupe A devait faire un pot par jour pendant 30 jours (donc 30 pots au total). Le groupe B devait travailler sur un seul pot pendant les 30 jours entiers. À la fin du mois, Brian jugea la qualité des pots. Sans exception, les 10 meilleurs pots provenaient du groupe A, ceux qui faisaient un pot par jour. Aucun ne provenait du groupe qui s'était concentré sur l'amélioration d'un seul pot."
                            },
                            {"paragraph":[
                                "Les étudiants qui cherchent à s'améliorer doivent pratiquer de manière approfondie. La pratique délibérée est généralement la meilleure approche et elle est déjà bien documentée : pratiquez, mais faites-le avec un plan."
                            ]},
                            {"paragraph":[
                                "En particulier, en empruntant à Polya, une bonne approche de la pratique délibérée consiste à faire plusieurs tentatives, de manière itérative, en se basant sur ses 4 principes : comprendre le problème, faire un plan, exécuter le plan, revoir votre travail."
                            ]},
                            {"paragraph":[
                                "D'après mon expérience, la plupart des étudiants échouent sur au moins un de ces principes. Je crois que c'est un échec des enseignants qui ne communiquent pas (ou peut-être ne comprennent pas) que ces mêmes principes sont les raisons pour lesquelles nous éduquons de la manière dont nous le faisons :"
                            ]},
                            {"list":[
                                "Cours/Démonstration : comprendre le problème.",
                                "Instructions : faire un plan (plus les instructions sont vagues, plus cela est délégué à l'étudiant).",
                                "Devoirs : exécuter le plan.",
                                "Notes, examens, retours : revoir votre travail."
                            ]},
                            {"paragraph":[
                                "En tant qu'étudiant qui n'est pas familier avec ces principes, l'école semble stupide et souvent arbitraire dans ses méthodes.",
                                "En tant qu'enseignant, ne pas connaître ces principes pourrait conduire à une dynamique qui, souvent, peut être assez infructueuse tant pour les étudiants que pour l'enseignant.",
                                "Pensez aux films classiques sur le lycée, ou aux longs détours pendant les cours : divertissant, mais le temps serait mieux utilisé à le faire avec des amis qu'avec un vieil inconnu.",
                                "Nous recherchons un enseignant pour nous enseigner : vous ne voudriez pas que votre médecin retarde une chirurgie pour parler de son divorce."
                            ]},
                            {"paragraph":[
                                "Naturellement, vous avez peut-être remarqué que tout n'est pas aussi facile à pratiquer.",
                                "Vous pourriez penser à l'apprentissage de l'anglais, où vous êtes gravement désavantagé : les parents de vos camarades le parlent, et ils peuvent facilement pratiquer à la maison, mais vous ne le pouvez pas !",
                                "Ou aux mathématiques, lorsque votre frère est comptable et peut vous guider à travers les 4 principes.",
                                "Il y a même des choses qui pourraient sembler impossibles à pratiquer : comme passer un examen ou faire un salto arrière."
                            ]},
                            {"paragraph":[
                                "C'est là que nous devons être créatifs. Si pour apprendre efficacement, nous devons pratiquer encore et encore, alors nous devons trouver un moyen de transformer n'importe quel sujet en un sujet que l'on peut pratiquer. J'ai observé que pour rendre la pratique délibérée possible, nous avons besoin de deux ingrédients :"
                            ]},
                            {"list":[
                                "Un espace sûr pour échouer.",
                                "Un retour d'information solide : un retour d'information solide est rapide, fréquent et exploitable."
                            ]},
                            {"paragraph":[
                                "Les jeux font cela de manière excellente, et vous remarquerez que les joueurs qui jouent le plus sont généralement bien meilleurs que ceux qui jouent moins. Cela est dû au fait que les jeux sont conçus de manière à optimiser la pratique efficace :"
                            ]},
                            {"list":[
                                "Si vous échouez, vous pouvez rejouer et tout ira bien (c'est sûr).",
                                "Quand vous échouez, vous le savez immédiatement et vous pouvez réessayer (Retour d'information solide)."
                            ]},
                            {"paragraph":[
                                "Construire un espace sûr pour la pratique et créer une ligne de retour d'information solide a historiquement été assez difficile (et coûteux) en dehors des jeux vidéo, et a été la cause de nombreuses disparités dans l'éducation."
                            ]},
                            {"title": "Espace de sécurité et retour d'information solide:"},
                            {"paragraph":[
                                "Avec l'avènement d'Internet, il est devenu beaucoup plus facile de pratiquer des sujets qui sont moins sûrs (comme les relations humaines).",
                                "À présent, vous pouvez obtenir un retour d'information rapide sur vos compétences en matière de conversation en rejoignant un forum en ligne, et vous pouvez même pratiquer un examen de code sur les éditeurs en ligne sans jamais déranger un camarade de classe."
                            ]},
                            {"paragraph":[
                                "Cependant, nous ne devrions pas nous fier uniquement à Internet. Un autre domaine où les enseignants peuvent vraiment briller est en créant une classe où les étudiants se sentent en sécurité pour échouer, mais aussi en créant une structure qui leur fournit un retour d'information de qualité."
                            ]},
                            {"paragraph":[
                                "Nous ne devrions pas non plus perdre de vue le fait que l'échec doit être constructif. Faire un effort est une chose, mais nous devons aider les étudiants à comprendre comment améliorer ces efforts à chaque itération."
                            ]},
                            {"paragraph":[
                                "C'est là que nous devons renforcer les associations avec les choses que nous avons déjà apprises, et renforcer les connexions. Plus vous pouvez faire de connexions, plus les informations resteront ancrées dans votre cerveau."
                            ]},
                            {"paragraph":[
                                "C'est un point fondamental de l'apprentissage efficace. Plus vous construisez une structure de connaissances autour de ce que vous apprenez, plus il sera facile de s'en souvenir et de l'appliquer."
                            ]},
                            {"paragraph":[
                                "Cela m'amène à une distinction que nous faisons entre l'enseignement d'idées abstraites et concrètes. Pour illustrer cela, je pense à un étudiant en programmation qui doit apprendre ce qui suit :"
                            ]},
                            {"list":[
                                "Choses concrètes : La syntaxe d'un langage de programmation, des outils spécifiques, des IDE, etc.",
                                "Choses abstraites : Des motifs de conception, des principes d'architecture logicielle, etc."
                            ]},
                            {"paragraph":[
                                "D'après mon expérience, les choses concrètes sont celles que vous ne pouvez pas vous enseigner. Les choses abstraites, en revanche, sont celles que vous pouvez souvent apprendre par vous-même avec facilité."
                            ]},
                            {"paragraph":[
                                "Par exemple, on pourrait apprendre la syntaxe en lisant un livre ou en suivant des tutoriels en ligne. Vous ne le comprendrez peut-être pas immédiatement, mais avec de la pratique, vous y parviendrez."
                            ]},
                            {"paragraph":[
                                "Cependant, comprendre les motifs de conception nécessite une approche différente. Cela implique d'identifier des motifs dans ce que vous avez appris concrètement, puis de les relier à des idées abstraites."
                            ]},
                            {"paragraph":[
                                "Par conséquent, mon opinion est qu'il est du devoir d'un enseignant de montrer comment les idées abstraites émergent des choses concrètes, fournissant une structure aux étudiants pour qu'ils puissent établir ces connexions par eux-mêmes.",
                                "Bien sûr, il existe une autre façon de voir les choses :",
                                "Quand j'étais enfant, mon professeur d'art disait que je pouvais apprendre n'importe quoi si je le décomposais en formes simples et concrètes. Commencez par dessiner des cercles, des lignes droites et des courbes, et bientôt vous pourrez dessiner un chat.",
                                "Pensez aux enfants qui commencent par dessiner des bonshommes. Ils apprennent quelque chose de concret. À mesure qu'ils deviennent plus habiles, leurs dessins deviennent plus abstraits et complexes."
                            ]},
                            {"title": "Réflexions finales."},
                            {"paragraph":[
                                "Je pourrais continuer à parler de cela. Mais en résumé, un enseignement efficace est à la fois un art et une science. Cela nécessite à la fois une approche structurée et la flexibilité pour s'adapter aux besoins des étudiants."
                            ]},
                            {"paragraph":[
                                "L'apprentissage est un voyage, et l'enseignement est la direction dans ce voyage. Avec une pratique efficace, un espace sûr, des retours d'information solides, et un équilibre entre l'abstrait et le concret, nous pouvons faire de ce voyage quelque chose de productif et gratifiant."
                            ]},
                            {"paragraph":[
                                "Enfin, je voudrais conclure par une citation inspirante :"
                            ]},
                            {"quote":
                                "Enseigner, c'est apprendre deux fois. — Joseph Joubert"
                            }
                        ]
                    },
                    {
                        "title": "Vous n'existez pas vraiment",
                        "description": "L'identité n'est qu'une abstraction utile; pas la réalité.",
                        "image": "images/vlog_thumbnails/sisyphus.jpeg",
                        "contents": [
                            {"title": "Qui êtes-vous ?"},
                            {"paragraph": [
                                "Non, je ne vous ai pas demandé votre nom, ni votre profession ni vos passe-temps du dimanche après-midi. Qui êtes-vous ?",
                                "Quand j'étais enfant, je me souviens d'un moment où ma mère m'a posé cette question. Cela m'a finalement conduit à paniquer ; pour chaque réponse que je donnais, il y avait un « mais est-ce vraiment ce que vous êtes ? ». Qui suis-je ?",
                                "Et pourtant, lorsque vous me demandez qui est quelqu'un d'autre, c'est une question tout à fait naturelle, avec des réponses assez simples."
                            ]},
                            {"title": "Perception et Abstractions."},
                            {"paragraph": [
                                "Le monde est extrêmement complexe. Il y a trop d'informations pour que notre cerveau puisse tout traiter, donc nous devons sélectionner. Notre perception est directement liée à notre cognition de manière si enchevêtrée que vous verrez principalement ce que vous attendez déjà (voir l'expérience du 'Gorille Invisible').",
                                "Comment faire sens de ce chaos ?"
                            ]},
                            {"paragraph": [
                                "Abstractions. Modèles et abstractions."
                            ]},
                            {"paragraph": [
                                "Lorsque nous observons le monde, différentes personnes voient différentes choses. S'il existe une chose telle qu'un monde nouménal unique, il existe un monde phénoménal unique à chacun de nous (l'optimiste dirait que le monde est à vous... hehe).",
                                "Ces mondes perçus (phénoménaux) diffèrent selon nos façons de penser, et parfois des différences dans nos sens (vos yeux ne sont pas nécessairement identiques aux miens !).",
                                "La perception que nous avons est unique à nous-mêmes. Et nos interprétations de ce que nous voyons le sont aussi.",
                                "Notre compréhension du monde est un mélange : connaissance et stimuli. Vous percevez, vous ressentez et vous donnez du sens à l'information avec ce que vous « savez » du monde. Votre raisonnement est encadré par les contraintes de tous vos raisonnements antérieurs, de tout ce que vous avez vu. Chaque mélodie, chaque peinture, chaque sourire et chaque erreur ; ils changent tous votre façon de penser.",
                                "Cependant, votre connaissance est finie : nous ne savons rien à une granularité infinie, mais seulement jusqu'à un certain niveau de détail. Rare est la personne qui est à la fois consciente des plus infimes mécanismes physiques dans ses ongles, et des jeux de l'esprit qui régissent la diplomatie.",
                                "Pour comprendre, nous devons limiter le détail. Nous devons abstraire."
                            ]},
                            {"paragraph": [
                                "Abstractions. Modèles et abstractions.",
                                "Le domaine des abstractions est trop vaste, et il n'est pas nécessaire de tout explorer pour montrer que vous n'existez pas.",
                                "Bien que nous abstractions de nombreuses manières (et de manière assez fascinante), concentrons-nous sur les abstractions que vous faites tous les jours lors de vos trajets : les gens.",
                                "Lorsque nous percevons Quelqu'un d'Autre, nous devons donner un sens à ce que nous percevons : l'apparence de leur visage, leurs yeux, le son de leur voix ou la chaleur de leurs mains. Nous regroupons toutes ces informations en une seule agglomération : une personne.",
                                "Nous pouvons accumuler des détails que nous associons à cette personne : ce qui la fait rire, sa démarche, la façon dont elle regarde le ciel étoilé ou crie dans la circulation. Qu'elle vous semble être un ami ou un ennemi (qui, en eux-mêmes, sont des abstractions). À mesure que nous augmentons le détail, nous avons l'impression de mieux la connaître.",
                                "Lorsque vous êtes interrogé sur qui elle est, vous répondrez avec un sous-ensemble de ces détails. C'est utile. Si vous deviez absorber chaque bit (jeu de mots) d'information sur quelqu'un avant de pouvoir en parler, les interactions sociales seraient incroyablement coûteuses en temps, en mémoire et en utilisation de votre cerveau.",
                                "Pourtant, les abstractions sont utiles précisément pour la même raison qu'elles sont dangereuses. Elles manquent de détail. Elles manquent de nuance.",
                                "Les abstractions sont dangereuses lorsqu'on parle de conflit (pensez à l'idée de l'ennemi), elles sont dangereuses lorsqu'on parle d'amour, elles sont dangereuses lorsqu'on écoute : si nous écoutons pour la vérité, plutôt que pour l'abstraction, nous serions induits en erreur par un sentiment de confiance infondé mais très fort.",
                                "Ce manque de granularité signifie que vous ne saurez jamais vraiment qui est quelqu'un d'autre. Pas entièrement. Vous ne pouvez au mieux les connaître mieux que quiconque, mais si nous sommes sincères, nous devons reconnaître que nous ne saurons jamais qui quelqu'un est vraiment."
                            ]},
                            {"title": "Le miroir, et pourquoi vous ne pouvez pas vous connaître."},
                            {
                                "image": "images/vlog_images/mirror.png",
                                "caption": "Homme regardant dans le miroir",
                                "link": "https://www.mutualart.com/Artwork/Man-With-a-Mirror/0833A9BCDCD04E35"
                            },
                            {"paragraph": [
                                "Quand vous vous regardez dans le miroir, que voyez-vous ? C'est en répondant « Moi-même » que nous nous condamnons immédiatement, involontairement à l'abstraction. L'image reflétée est simplement une représentation superficielle, un instantané de l'apparence physique qui ne fait qu'effleurer la surface de notre véritable essence.",
                                "Mais au-delà du reflet physique se trouve un labyrinthe de complexités, de contradictions et de pensées et d'émotions en perpétuel changement. Tenter de se définir soi-même, c'est comme essayer d'attraper des ombres ; plus nous cherchons à saisir notre identité, plus elle semble nous échapper.",
                                "On pourrait dire que l'introspection offre un chemin vers la découverte de soi, un voyage intérieur pour découvrir les vérités enfouies dans notre psyché. Mais même l'introspection a ses limites, car nos perceptions de nous-mêmes sont teintées de biais, d'insécurités et d'influences externes.",
                                "Et qu'en est-il du rôle de la mémoire dans la formation de notre sens de soi ? Les souvenirs ne sont pas des enregistrements immuables du passé, mais des récits malléables qui évoluent avec le temps, façonnés par des rappels sélectifs et des réinterprétations. Nos souvenirs d'événements passés sont filtrés à travers le prisme de la conscience présente, teintés d'émotions et de perceptions qui peuvent déformer ou embellir la vérité.",
                                "En fin de compte, la quête pour se connaître soi-même peut être un exercice de futilité, une lutte sisyphéenne contre la marée de l'impermanence et de l'incertitude. Peut-être, au lieu de chercher à nous définir, devrions-nous embrasser l'énigme de notre existence, en acceptant la fluidité et l'ambiguïté de l'identité.",
                                "Car en l'absence d'un soi fixe, il existe un potentiel infini d'exploration et de découverte, un voyage de découverte de soi qui transcende les contraintes de la définition et de la limitation."
                            ]},
                            {"title": "Physicalité, unité : vous vous fondez dans l'univers."},
                            {
                                "image": "images/vlog_images/cosmos.png",
                                "caption": "Homme regardant dans le miroir",
                                "link": "https://www.ashvinharrison.com/product/abstract-universe-moon-illusion/"
                            },
                            {"paragraph": [
                                "Nous avons montré que la pensée du soi (phénoménal) est de l'eau, une rivière, un flux. Un courant qui ne peut être encapsulé par l'identité, mais qui coule, se plie et mute chimiquement à travers la vie.",
                                "Cependant, l'abandon du soi doit également être reconnu dans le domaine matériel (nouménal).",
                                "Il semble plus facile de répondre à la question de savoir où se trouve votre corps, où vous êtes physiquement et de quelles dimensions. En effet, nous avons des moyens appropriés de mesurer ces choses (bien que j'invite le lecteur à réfléchir à ce qu'est même une mesure). Cependant : avec quel détail ?",
                                "Le corps n'est pas une entité statique mais un écosystème dynamique grouillant de vie. Considérez les trillions de micro-organismes qui habitent votre corps, des bactéries dans votre intestin aux champignons sur votre peau. Nous ne sommes pas des êtres solitaires mais - principalement - des organismes symbiotiques, intimement connectés au réseau de la vie qui nous entoure.",
                                "Et pourtant, même à l'intérieur des limites de notre propre chair, les frontières du soi se brouillent et se dissolvent. La distinction entre soi et autre devient de plus en plus nébuleuse à mesure que nous plongeons plus profondément dans les complexités de la biologie humaine. Qu'est-ce qui est vous et qu'est-ce qui est étranger ? Êtes-vous votre système immunitaire ? Les bactéries sur votre peau ? Votre microbiote ? Votre sang ? L'eau qu'il contient ?",
                                "Les vieilles cellules sont continuellement remplacées par de nouvelles dans un processus de régénération et de renouvellement. À chaque instant qui passe, nous perdons des fragments de nous-mêmes dans le monde, laissant des traces de notre existence dans l'air que nous respirons, la nourriture que nous mangeons et la terre sous nos pieds. Sommes-nous rien d'autre qu'un bateau de Thésée éternel, dont les planches sont de l'eau et retournent à l'océan ?",
                                "Encore plus atomiquement, nos corps ne sont pas séparés du cosmos mais matériellement joints à lui. Nous sommes de la poussière d'étoiles. Nous sommes faits de l'univers et maintenus ensemble par lui à chaque souffle, chaque pas, chaque rire et chaque larme.",
                                "Lorsque vous regardez vos doigts en pensant « c'est là que mes doigts se terminent », considérez qu'il y a même là des atomes de vous plus loin, et des atomes non-vous plus à l'intérieur. Les limites du corps sont comme l'idée même du corps, floues, pratiques, mais purement conceptuelles.",
                                "Quand nous levons les yeux vers le ciel nocturne, nous ne sommes pas simplement des observateurs mais des participants à une danse de l'éternité, dans l'espace et le temps. Nous nous voyons nous-mêmes, passé et futur.",
                                "Alors, quand nous posons la question, 'Qui êtes-vous ?' Ne cherchons pas des réponses dans les confins de l'identité ou les limites du corps. Au lieu de cela, embrassons l'immensité sans bornes de l'être, reconnaissant que nous ne sommes pas séparés de l'univers mais des parties intégrales de son histoire en perpétuelle évolution.",
                                "Quand on nous demande « Qui êtes-vous ? » Répondons utilement, socialement, avec les informations dont l'interlocuteur a besoin, mais reconnaissons que la vraie réponse fondra à jamais entre nos doigts.",
                                "La vraie réponse est simple. La vraie réponse est libératrice, émancipatrice. La vraie réponse est harmonieuse."
                            ]},
                            {"paragraph": [
                                "Vous n'existez pas."
                            ]}
                        ]
                    },                    
                    {
                        "title": "Sur les Limites de la Communication: Seul Vous Savez Ce Que Vous Savez",
                        "description": "Seul vous savez ce que vous savez",
                        "image": "images/vlog_thumbnails/communication.png",
                        "contents": [
                            {"title": "Introduction"},
                            {"paragraph": [
                                "Parlez. Codez. Lisez. Écrivez.",
                                "Dessinez. Chantez. Bougez. Écoutez."
                            ]},
                            {
                                "image": "images/vlog_images/birds_singing.png",
                                "caption": "Homme regardant un miroir",
                                "link": "https://pixabay.com/photos/singing-birds-sing-nature-song-3948645/"
                            },
                            {"paragraph": [
                                "La joie d'être entendu, la connexion dans le contact visuel. La communication est la fondation de toute espèce sociale. Mais en son cœur, ce n'est que la transmission d'informations.",
                                "Sans communication, il n'y a pas de compréhension. Pas de connexion. Des progrès lents à inexistants. Quand j'étais enfant, je me souviens d'un moment où ma mère m'a posé cette question. Cela m'a finalement conduit à paniquer; pour chaque réponse que je donnais, il y avait un « mais est-ce qui vous êtes ? ». Qui suis-je ?",
                                "Et pourtant, lorsque vous me demandez qui est quelqu'un d'autre, c'est une question des plus naturelles, avec des réponses assez simples."
                            ]},
                            {"paragraph": [
                                "Nous devons communiquer; cependant, nous nous trouvons souvent en difficulté face aux limitations naturelles pour le faire. Pourquoi ?"
                            ]},
                            {"title": "Ce que les gens enseignent ne sera jamais le même que ce que les gens veulent apprendre."},
                            {"paragraph": [
                                "Nous avons tous été là. Vous êtes assis dans une salle de classe, vous vous demandez sur un détail de ce que le professeur a expliqué. Vous posez une question, et vous avez l'impression qu'il répond à une question totalement différente. Peut-être avez-vous la chance d'apprendre quelque chose de nouveau, mais votre confusion demeure.",
                                "Parfois, nous avons été de l'autre côté. Un junior vous pose une question sur un sujet que vous avez déjà expliqué plusieurs fois, vous répondez, et ils hochent la tête cérémonieusement, mais vous savez tous les deux que, quelle que soit la raison de leur question, elle imprègne vos enseignements.",
                                "Malgré les meilleurs efforts du professeur, l'écart entre ce qui est enseigné et ce qui est compris persiste.",
                                "Frustrant, mais pourquoi cela se produit-il ? Pourquoi cela continue-t-il à travers les cultures et les vocations ?"
                            ]},
                            {"title": "Contexte"},
                            {"paragraph": [
                                "Contexte. Les symboles ne signifient rien sans contexte. Tout ce que nous savons, nous le savons dans un ensemble de contraintes, d'assumptions et d'informations adjacentes.",
                                "Cet ensemble est généralement sous-texte : il n'est explicitement signalé nulle part en particulier, et nous ne sommes même pas nécessairement conscients de son existence. Pourtant, il n'y a aucune pensée dans votre esprit qui serait sensée sans contexte; sans les définitions des mots que vous utilisez pour l'énoncer, les suppositions implicites que vous faites ou les choses que vous supposez que tout le monde doit savoir.",
                                "La nature discrète de cette information contextuelle est particulièrement problématique pour les experts. Lorsqu'un expert communique, il présume souvent que ce qu'il dit est évident ou du bon sens. Pour eux, c'est le cas, car leurs connaissances contextuelles sont riches dans ce domaine, et donc beaucoup de leurs observations sont de simples conséquences de ce qu'ils savent.",
                                "Nous échouons -trop fréquemment- à reconnaître que ce contexte est précisément notre expertise, et présumer que cette information est largement partagée bloque effectivement notre capacité à nous comprendre, à travailler ensemble, à nous entendre, et à nous connecter sincèrement.",
                                "Le contexte interfère avec de nombreuses autres tâches basées sur la communication : la résolution des conflits est plus difficile, lorsque vous ne comprenez pas d'où vient l'autre côté, la culture est plus difficile à apprécier avec une vue superficielle (sans contexte), la collaboration est entravée par des malentendus fondamentaux sur le travail à faire ou ses coûts.",
                                "D'un autre côté, fournir trop de contexte dans la communication est souvent inutile : cela prend du temps à partager, cela prend du temps à consommer, et n'inclut le plus souvent même pas les informations que l'autre personne veut réellement. Même lorsque nous essayons de mieux communiquer, nous sommes constamment empêchés d'atteindre la perfection.",
                                "Le contexte nous rend savants, mais il semble entraver tant de choses dans la communication entre nous. Nous devons nous demander : est-ce le contexte ? Ou est-ce nous ?",
                                "Je soutiens que ce n'est pas vous (le contexte), c'est moi."
                            ]},
                            {"title": "Seul je sais ce que je sais :"},
                            {"paragraph": [
                                "Les gens sont compliqués. Nous savons beaucoup, beaucoup de choses.",
                                "Cependant, nous ne stockons pas nos connaissances dans une mémoire partagée. Il n'y a pas de mentalité collective factuelle.",
                                "Vous savez ce que vous savez, et je sais ce que je sais.",
                                "Mais si je vous demande « Qu'est-ce que vous savez ? », en attendant une liste de toutes les informations dans votre cerveau, vous trouveriez cela des plus ridicules. Même en supposant que vous puissiez établir une telle liste, vous ne réussiriez pas à la communiquer correctement (voir le titre de l'article). Mais vous ne pouvez pas établir une telle liste.",
                                "Pourquoi ?",
                                "« Qu'est-ce que vous savez ? » tombe, je pense, dans la même branche d'enquête que des questions telles que « Qui êtes-vous ? » (que j'ai explorées dans un autre article : « Vous n'existez pas vraiment »)",
                                "Pour la plupart d'entre nous, une limitation suffisante pour répondre entièrement à ces questions est la vague de ce que signifie la question. Qu'est-ce que « savoir » vraiment ? Qu'est-ce que « moi » ?",
                                "Est-ce que je sais quelque chose si je sais où le trouver ? Est-ce que je sais quelque chose si cela m'a été enseigné par quelqu'un d'autre ? Comment pouvons-nous être sûrs que cette autre personne le savait correctement ? Qu'est-ce que cela signifie pour eux de savoir ?",
                                "La question de ce que nous savons est par nature récursive ad nauseam. Il y a toujours l'étape suivante de « Mais comment savons-nous cela ? » jusqu'à ce que nous atteignions des suppositions axiomatiques. Les axiomes ne sont pas connaissables, ils sont simplement supposés. Donc, nous pouvons supposer, puis nous pouvons inférer des suppositions."
                            ]},
                            {"title": "Nous ne pourrons jamais savoir"},
                            {"paragraph": [
                                "Alors… nous ne pouvons pas savoir les choses. Voilà, merci pour votre lecture, aventurons-nous dans les rues avec une terreur cynique de notre condamnation à l'ignorance éternelle.",
                                "C'est une interprétation impratique.",
                                "Je pense qu'il existe une interprétation alternative que je trouve non seulement infiniment plus utile, et plus intéressante, mais aussi sincèrement assez libératrice."
                            ]},
                            {
                                "image": "images/vlog_images/hummingbird.png",
                                "caption": "Homme regardant un miroir",
                                "link": "https://www.audubon.org/news/hummingbirds-shake-their-tail-feathers-generate-high-pitched-sounds"
                            },
                            {"paragraph": [
                                "L'enseignement, et en effet toute communication, n'a jamais porté sur des choses connaissables. Cela a toujours été -et je pense que cela le sera toujours- de se convaincre et de se persuader mutuellement d'exploiter des informations utiles, des méthodes utiles, des outils utiles, et des pratiques utiles pour vivre mieux. Pour poser de meilleures questions, pour résoudre des problèmes plus importants.",
                                "Penser à la communication comme un transfert de la vérité est une arrogance très humaine. Nous ne pouvons pas connaître la vérité, pas d'une manière réelle. Mais nous pouvons connaître la vérité de nombreuses façons utiles.",
                                "Les enfants sont d'une transparence excellente à cet égard. Pour toute vérité que vous tenez pour indéniable, ils la remettront en question sans malice mais avec une simple curiosité : car rien de ce que vous savez n'est vraiment indéniable."
                            ]},
                            {"paragraph": [
                                "Mais qu'est-ce que tout cela nous dit sur la communication entre nous ?",
                                "S'il n'y a pas de connaissance fondamentale réelle, mais plutôt juste des bribes utiles, que faisons-nous vraiment ?"
                            ]},
                            {"title": "Conclusion : nous faisons de notre mieux. Mais pas le meilleur."},
                            {"paragraph": [
                                "Nous ne savons rien, et pourtant nous continuons... à parler. Nous parlons, nous écrivons, nous chantons, et nous essayons.",
                                "Nous communiquons nos savoir-faire, nos avertissements, nos récits, nos histoires et nos conseils.",
                                "Nous communiquons pour nous aider les uns les autres ; pour nous aider nous-mêmes.",
                                "Nous faisons de notre mieux."
                            ]},
                            {"paragraph": [
                                "Cependant, soyons en permanence conscients : nous ne communiquerons jamais de la meilleure manière.",
                                "Nous ne pouvons pas, alors soyons humbles. Conversons, continuons d'essayer.",
                                "Être imparfait nous donne le pouvoir de l'itération, de réessayer, d'aller et venir."
                            ]},
                            {"paragraph": [
                                "Continuons à nous entraider, mais la prochaine fois qu'un élève lève la main, souvenez-vous : ils ne peuvent pas poser la question parfaite, et vous ne pouvez pas leur dire exactement ce qu'ils veulent.",
                                "Mais c'est mieux si vous essayez."
                            ]},
                            {
                                "image": "images/vlog_images/helping_hand.png",
                                "caption": "Homme regardant un miroir",
                                "link": "https://www.pinterest.com/pin/634937247461784490/"
                            }
                        ]
                    },
                    {
                        "title": "Visez à faire, pas à être.",
                        "description": "Réflexions sur l'état d'esprit qui m'a apporté la paix et ce que je considère comme une croissance saine et durable.",
                        "image": "images/vlog_thumbnails/compass.jpeg",
                        "contents": [
                            {"title": "Visez à faire, pas à être."},
                            {
                                "image": "images/vlog_images/self.webp",
                                "caption": "Illustration par Zoe Liu dans Comment notre cerveau préserve notre sentiment de soi - Scientific American",
                                "link":"https://www.scientificamerican.com/article/how-our-brain-preserves-our-sense-of-self/"
                            },
                            {"paragraph":[
                                "Que veux-tu devenir quand tu seras grand ?",
                                "Qui es-tu ?"
                            ]},
                            {"paragraph":[
                                "Pourquoi prenons-nous la peine de répondre à ces questions ?",
                                "Qu'essayons-nous vraiment de comprendre avec elles ?",
                                "Ma thèse est que nous cherchons une description simplifiée des gens : « Oh, ce gars est A, ce gars est B. »",
                                "Cela facilite la discussion sur nous-mêmes et les autres, en réduisant nos identités à de simples étiquettes."
                            ]},
                            {"paragraph":[
                                "Mais voici le problème : demander ce que nous voulons être est une erreur, un malentendu.",
                                "C'est comme confondre la photo avec la personne.",
                                "L'identité est un instantané, quelque chose de fluide et en constante évolution.",
                                "Plutôt que de se concentrer sur la capture de la photo parfaite - comme nous en avons pris l'habitude - je dirais que le cadre le plus puissant est de danser du mieux que nous pouvons."
                            ]},
                            {"title": "Construire."},
                            {
                                "image": "images/vlog_images/beaver.jpg",
                                "caption": "Castor se relaxant dans son barrage",
                                "link":"https://www.brainson.org/episode/2023/09/19/how-do-animals-build-their-homes"
                            },
                            {"paragraph":[
                                "Priorisez. Faites de la musique plutôt que d'être musicien. Faites du sport plutôt que d'être athlète. Construisez des choses plutôt que d'être ingénieur. Découvrez et émerveillez-vous plutôt que d'être scientifique. Concentrez-vous sur l'acte, l'expérience, la joie de faire."
                            ]},
                            {"paragraph":[
                                "Par exemple, considérez la différence entre « être musicien » et « faire de la musique ».",
                                "Le premier est un titre, une abstraction d'attentes.",
                                "Le second est une liberté, une expérience, une bonne idée, un après-midi détendu.",
                                "Lorsque vous privilégiez la création de musique, vous vous autorisez à explorer, à échouer, à grandir - sans la pression de devoir répondre au titre de « musicien »."
                            ]},
                            {"paragraph":[
                                "Si la perfection est l'ennemie du bien, alors l'attente est l'ennemie de l'action. Et l'action est le chemin vers la croissance. Dans l'action et la croissance, vous construisez le moi constant que vous souhaitez être. Construisez des choses, construisez votre vie et construisez-vous : il n'y a pas de projet plus important que vous, car sans vous, il n'y a rien d'autre à faire."
                            ]},
                            {"paragraph":[
                                "Alors, aimez et jouez. Faites des choses. Visez à faire, pas à être. Ce faisant, vous pourriez découvrir que les étiquettes - si elles importent - viendront naturellement, façonnées par la richesse de vos expériences."
                            ]}
                        ]
                    },
                    {
                        "title": "Sur les comportements émergents",
                        "description": "Réflexion sur certaines des manières dont des règles simples génèrent notre monde chaotique.",
                        "image": "images/vlog_thumbnails/emergent_behavior.webp",
                        "contents": [
                            {"paragraph":[
                                "Règle 1 : Ne pas parler du fight club.", 
                                "Règle 2 : Pas d'armes.", 
                                "Règle 3 : Ne pas parler du fight club.",
                                "L'anarchie s'ensuit."
                            ]},
                            {"title": "Sur les comportements émergents."},
                            {
                                "image": "images/vlog_images/emergence.jpg",
                                "caption": "Boules de fromage, Napanoch, New York, 2012 - Partie de la collection Comportement Émergent de Thomas Jackson",
                                "link":"https://www.thomasjacksonphotography.com/emergent-behavior.html"
                            },
                            {"paragraph":[
                                "Un atome gigote dans l'espace. Il gigote pas seul mais avec des amis. Ils gigotent plus que d'habitude et tu brûles de fièvre. Ils gigotent moins et tu gèles. Certains gigotent ici, d'autres là."
                            ]},
                            {"paragraph":[
                                "Certains gigotent juste dans l'espace où se produisent les synapses, formant ton liquide céphalo-rachidien : ces atomes qui gigotent te maintiennent en vie. D'autres gigotent légèrement à côté, disposés de manière très pratique, formant des groupes d'atomes (a.k.a. Boy Bands Gigotants) que nous appelons molécules.",
                                "Le nom vient du nombre d'atomes dans une molécule, mais je ne prendrai pas le temps d'un Mole pour expliquer."
                            ]},
                            {"paragraph":[
                                "Ces molécules traînent. Elles se détendent, elles vibrent même. Elles, comme des mots dans une phrase, s'organisent simplement en une cellule.",
                                "Les cellules elles-mêmes sont organisées d'une manière assez intelligente, et nous l'appelons Neurone. Si elles se cassent d'une manière spécifiquement maléfique, nous l'appelons Cancer."
                            ]},
                            {"paragraph":[
                                "Nous appelons ce groupe qui gigote température. Avec cela seul, nous commençons déjà à voir émerger une complexité significative : tu peux avoir des neurones froids ou des neurones chauds, un cancer froid ou un cancer chaud. Tu peux avoir des cellules faites de ces molécules ou de ces autres molécules. Tu peux avoir quelque chose ici ou quelque chose là."
                            ]},
                            {"paragraph":[
                                "Déjà, avec juste quelques choses simples en tête, il y a tant à découvrir."
                            ]},
                            {"paragraph":[
                                "De si petites choses, avec des règles si simples en leur essence."
                            ]},
                            {"paragraph":[
                                "Pourtant, lorsque nous empilons des couches sur des couches de simplicité, nous obtenons la vie. Nous obtenons tout. Cela peut sembler surprenant, mais les mathématiques le rendent assez évident.",
                                "Si tu as n couches, avec Xn règles chacune, alors tu as naïvement un total de X1 * X2 * ... * Xn règles au total.",
                                "C'est beaucoup de règles qui peuvent définir tant de combinaisons différentes !"
                            ]},
                            {"paragraph":[
                                "Qu'est-ce que la vie ? Mon soupçon est que le mot en lui-même est simplement un classificateur. Notre cerveau simplifiant le monde à notre grand bénéfice pour vivre, mais à notre grand détriment pour comprendre."
                            ]},
                            {"paragraph":[
                                "Je pense que la vie n'est pas une seule chose. Je pense que la vie est cette permutation de règles extrêmement variées et riches.",
                                "La vie est la combinaison de toutes ces petites choses qui se produisent, et qui parfois se permutent en choses plus grandes que notre cerveau perçoit et classe. La vie, c'est quand nous disons “oh ça, c'est vivant”."
                            ]},
                            {"paragraph":[
                                "Il existe aussi des définitions scientifiques de ce qu'est la vie, mais la science elle-même, c'est quand nous disons “oh ça, c'est de la science”.",
                                "Bien sûr, c'est moins subjectif que ton goût musical, mais ce n'est pas beaucoup plus objectif qu'une combinaison de toutes nos subjectivités. Opinions et idées mélangées avec des mesures, que nous ne pouvons finalement consommer qu'à travers nos sens.",
                                "Des singes essayant de faire de leur mieux pour se dissocier de leurs organes sensoriels pour voir une vérité supérieure. C'est tout un combat : même dans la phrase précédente, nous revenons aux sens, nous essayons de voir."
                            ]},
                            {"paragraph":[
                                "Qu'est-ce que l'intelligence ? Je pense que la réponse est en effet assez similaire : l'intelligence, c'est que je vois quelque chose et je pense qu'il pense. Singe voit, singe classe.",
                                "Mais allons au-delà du mot, qu'est-ce que cette idée d'intelligence ? (Quel idéalisme platonicien dans lequel nous nous adonnons)"
                            ]},
                            {"paragraph":[
                                "Je pense que l'intelligence est aussi juste une combinaison de règles. En nous, ce sont les règles jusqu'à la couche d'abstraction du cerveau, ou parfois de la combinaison de cerveaux dans de nombreux cerveaux : personnes ou autres."
                            ]},
                            {"paragraph":[
                                "Eh bien, alors, comment pourrions-nous jamais croire que seuls nous pouvons être intelligents ? N'est-ce pas une grande arrogance -sans fondement- ? Une terrible hybris humaine ?",
                                "Et pourquoi penserions-nous jamais que nous ne pouvons pas créer de l'intelligence ? C'est juste des combinatoires, pas de la science des fusées.",
                                "Aujourd'hui, nous essayons en combinant des règles de calcul et de statistiques, car nous avons senti que cela fonctionne mieux que d'autres choses que nous avons essayées (oui, la science semble principalement être “faire n'importe quoi et voir ce qui se passe”) mais ce ne sont que des ensembles arbitraires de règles que nous utilisons. S'il y a une limite à celles-ci, nous pouvons en utiliser d'autres."
                            ]},
                            {"paragraph":[
                                "Nous venons de types qui gigotent, est-ce si difficile d'imaginer que d'autres choses peuvent venir de nous ?"
                            ]},
                            {"paragraph":[
                                "C'est tout simplement... des comportements émergents."
                            ]}
                        ]
                    },
                    {
                        "title": "Soyez Bon et Grand",
                        "description": "Un rappel pour aspirer à la croissance, mais sans se déformer.",
                        "image": "images/vlog_thumbnails/good_and_great.jpeg",
                        "contents": [
                            {"paragraph":[
                                "Dans l'un des contes de Kafka, il nous parle de nombreux fils, nombreux fils archétypaux de nombreux hommes.",
                                "Chacun remarquable à sa manière, l'un extrêmement charmant, un autre très intelligent, un autre beau au point d'offenser les olympiens.",
                                "Pourtant, aucun d'eux n'a le charme sincère que je trouve dans celui qui est 'non remarquable'.",
                                "Non remarquable, naïf, pas très brillant, et pourtant il est aimable.",
                                "C'est lui qui mène la meilleure vie."
                            ]},
                            {"title": "Soyez Bon et Grand."},
                            {
                                "image": "images/vlog_images/trees.jpg",
                                "caption": "Arbre de Sang de Dragon, L'Arbre Millénaire de l'île Socotra",
                                "link":"https://mybestplace.com/en/article/dragons-blood-tree-the-millennial-tree-of-socotra-island"
                            },
                            {"paragraph":[
                                "Je veux plus."
                            ]},
                            {"paragraph":[
                                "Nous ne voulons pas tous plus ?"
                            ]},
                            {"paragraph":[
                                "Il y a toujours plus.",
                                "Le désir est un baril avec des trous, que nous remplissons et remplissons et remplissons, seulement pour le voir fuir et fuir et fuir.",
                                "La croissance est paradoxalement à la fois désirable et toxique. C'est un moteur, un carburant qui nous pousse en avant, un changement, une amélioration.",
                                "Pourtant, comme beaucoup d'arbres, il est trop facile de croître de travers."
                            ]},
                            {"paragraph":[
                                "Pour croître, nous devons d'abord être très sûrs de la direction dans laquelle nous croissons. Sans une direction claire, nous risquons de ne pas croître du tout mais simplement de vagabonder sans but."
                            ]},
                            {"paragraph":[
                                "D'un autre côté, la tentation de ne pas croître, de ne pas changer, peut être tout aussi dangereuse.",
                                "La stabilité a un certain charme, mais c'est un confort imprégné de toxicité.",
                                "Nous devons tous être continuellement en mouvement, ne serait-ce que pour suivre les marées de la terre et la vie autour de nous.",
                                "Lorsque la vie cesse de bouger, nous l'appelons un cadavre. Vivre, c'est bouger. Et bouger, c'est changer.",
                                "Si nous devons changer, faisons-le avec intention : grandissons."
                            ]},
                            {"paragraph":[
                                "Cependant, nous tombons souvent dans le piège de supposer que nous sommes bons simplement parce que nous ne faisons pas de mal. Cette perception est trompeuse : être inoffensif n'est pas la même chose que choisir de ne pas faire de mal."
                            ]},
                            {"paragraph":[
                                "Est-il bon de faire ce que les gens vous disent de faire ? De suivre ce que les autres déclarent comme bon ?",
                                "L'histoire nous a montré de nombreuses fois que ce n'est pas vrai, et les leçons sont gravées dans le sang.",
                                "Est-on vraiment bon si on manque de force pour aller à l'encontre des attentes sociales ? Ou est-ce simplement de la conformité ?"
                            ]},
                            {"paragraph":[
                                "La seule véritable façon de croître est de faire les deux : acquérir de la force et la diriger correctement.",
                                "La véritable croissance nécessite de se cultiver dans trois dimensions : compétence, le pouvoir de faire les choses (distinct de ce que nous appelons souvent pouvoir, que je qualifierais de corruption), et l'esprit : le cœur et l'âme."
                            ]},
                            {"paragraph":[
                                "Ce n'est qu'en se développant dans ces domaines que nous pouvons trouver la bonne direction et croître fermement dans celle-ci.",
                                "Ce n'est qu'alors que nous pourrons être véritablement bons et utiliser notre grandeur pour nous propulser en avant sur le bon chemin."
                            ]},
                            {"paragraph":[
                                "Pour s'assurer que votre croissance est intentionnelle, évaluez régulièrement votre direction. Demandez-vous :"
                            ]},
                            {"list":[
                                "Est-ce que je croît dans la bonne direction ?",
                                "Est-ce que je cultive les bonnes forces ?",
                                "Est-ce que je défie les attentes sociales lorsqu'elles entrent en conflit avec mes principes ?"
                            ]},
                            {"paragraph":[
                                "Réfléchissez à ces questions et ajustez votre trajectoire si nécessaire. La véritable croissance est intentionnelle et guidée par un sens bien développé de la direction et de l'intégrité."
                            ]},
                            {"paragraph":[
                                "Je ne vous donnerai pas de détails spécifiques. Vous savez déjà ce que vous devez faire.",
                                "Faites-le mieux. Soyez grand."
                            ]}
                        ]
                    }
                ]
        }
    }
}